<p>นี่คือธีม AdminLTE โดย <a href="https://almsaeedstudio.com/" target="_blank">https://almsaeedstudio.com/</a> ซึ่งเป็นเวอร์ชั่นตัดทอน เหลือสไตล์ชีทและสคริปต์ที่จำเป็น คุณสามารถดาวน์โหลดเวอร์ชั่นเต็มเพิ่มเติม เพื่อเพิ่มคอมโพเนนท์ให้กับแผงควบคุม</p>
<p>การทำงานทั้งหมดเป็นเพียงตัวอย่าง ยกเว้น<strong>การจัดการผู้ใช้</strong>ทางด้านซ้าย Laravel 5 Boilerplate มาพร้อมกับไลบรารี่เต็มรูปแบบเพื่อควบคุมและจัดการ ผู้ใช้/บทบาท/สิทธิ์</p>
<p>โปรดระลึกว่านี่เป็นงานที่อยู่ระหว่างการพัฒนา และอาจเกิดบั๊กหรือข้อผิดพลาดอื่นๆที่ยังไม่ถูกค้นพบ เมื่อรับทราบ ทางทีมงานจะทำเต็มที่เพื่อแก้ไขปัญหาที่เกิดขึ้น</p>
<p>หวังว่าคุณจะได้รับประโยชน์จากผลงานทั้งหมดนี้ที่ทางทีมงานทุ่มเทสร้างขึ้น กรุณาเยี่ยมชมหน้าของ <a href="https://github.com/rappasoft/laravel-5-boilerplate" target="_blank">GitHub</a> เพื่อข้อมูลเพิ่มเติมและ <a href="https://github.com/rappasoft/Laravel-5-Boilerplate/issues" target="_blank">รายงานข้อผิดพลาด</a> ได้ที่นี่</p>
<p><strong>โปรเจคนี้ต้องการการดูแลอัพเดทอย่างสม่ำเสมอ เนื่องด้วยการเปลี่ยนแปลงและพัฒนาของ master branch ของ Laravel Framework ดังนั้นทางทีมงานยินดีอย่างยิ่ง หากได้รับการช่วยเหลือ</strong></p>
<p>- Anthony Rappa</p>
