{
    "Your password has expired. We require you to change your password every :days days for security purposes.": "ពាក្យសម្ងាត់របស់អ្នកបានផុតកំណត់ហើយ។ យើងតម្រូវឱ្យអ្នកផ្លាស់ប្តូរពាក្យសម្ងាត់របស់អ្នកជារៀងរាល់ :days ថ្ងៃ សម្រាប់គោលបំណងសុវត្ថិភាព។",
    "You do not have access to do that.": "អ្នកមិនមានការអនុញ្ញាតឱ្យកើតប្រតិបត្តិការនេះទេ។",
    "Two-factor Authentication must be :status to view this page.": "ការបញ្ជាក់បញ្ជីពិនិត្យមានប្រភពពាក់ព័ន្ធមួយមិនត្រូវបានបើកទេ សូមបង្កើតការបញ្ជាក់បញ្ជីពិនិត្យមានប្រភពពាក់ព័ន្ធមួយមិនត្រូវបានបើកទេ",
    "One or more permissions were not found or are not allowed to be associated with this role type.": "មិនមានសិទ្ធិមួយឬច្រើនទៀតឬមិនត្រូវបានអនុញ្ញាតឱ្យបញ្ចូលទៅកាន់ប្រភេទនៃតួនាទីនេះទេ។",
    "You can not edit the Administrator role.": "អ្នកមិនអាចកែប្រែតួនាទីអ្នកគ្រប់គ្រងប្រព័ន្ធទេ។",
    "You can not delete the Administrator role.": "អ្នកមិនអាចលុបតួនាទីអ្នកគ្រប់គ្រងប្រព័ន្ធទេ។",
    "Only the administrator can change their password.": "តែអ្នកគ្រប់គ្រងប្រព័ន្ធអាចផ្លាស់ប្តូរពាក្យសម្ងាត់របស់ខ្លួនទេ។",
    "One or more roles were not found or are not allowed to be associated with this user type.": "មិនមានតួនាទីមួយឬច្រើនទៀតឬមិនត្រូវបានអនុញ្ញាតឱ្យបញ្ចូលទៅកាន់ប្រភេទនៃអ្នកប្រើប្រាស់ទេ។",
    "One or more permissions were not found or are not allowed to be associated with this user type.": "មិនមានសិទ្ធិមួយឬច្រើនទៀតឬមិនត្រូវបានអនុញ្ញាតឱ្យបញ្ចូលទៅកាន់ប្រភេទនៃអ្នកប្រើប្រាស់ទេ។",
    "Only the administrator can update this user.": "តែអ្នកគ្រប់គ្រងប្រព័ន្ធអាចធ្វើការប្រសិនបើអ្នកប្រើប្រាស់នេះមិនមែនជាអ្នកគ្រប់គ្រងប្រព័ន្ធទេ។",
    "You can not delete the master administrator.": "អ្នកមិនអាចលុបអ្នកគ្រប់គ្រងប្រព័ន្ធទេ។",
    "You can not clear your own session.": "អ្នកមិនអាចសម្អាតការកត់ឈ្មោះរបស់អ្នកទេ។",
    "Your account has been deactivated.": "គណនីរបស់អ្នកត្រូវបានបិទបញ្ជាទេ។",
    "Password successfully updated.": "ពាក្យសម្ងាត់ត្រូវបានកែប្រែដោយជោគជ័យ។",
    "Two Factor Authentication Successfully Disabled": "ការបញ្ជាក់ទទួលបានជោគជ័យនៅពេលបិទបញ្ជាការបញ្ជាក់ទទួលបានទេ។",
    "You must accept the Terms & Conditions.": "អ្នកត្រូវតែយល់ព្រមនិងការពិនិត្យនៃការអនុញ្ញាតឱ្យបានទទួលបានរួចហើយ។",
    "Any old backup codes have been invalidated.": "កុំព្យូទ័រចាស់ត្រូវបានបិទបញ្ជាទេ។",
    "Two Factor Recovery Codes Regenerated": "កុំព្យូទ័របានបង្កើតឡើងវិញទៅឡើងវិញបានស្រាច់ដោយជោគជ័យ។",
    "The role was successfully created.": "តួនាទីត្រូវបានបង្កើតដោយជោគជ័យ។",
    "The role was successfully updated.": "តួនាទីត្រូវបានកែប្រែដោយជោគជ័យ។",
    "The role was successfully deleted.": "តួនាទីត្រូវបានលុបដោយជោគជ័យ។",
    "The user was successfully updated.": "អ្នកប្រើប្រាស់ត្រូវបានកែប្រែដោយជោគជ័យ។",
    "The user was successfully created.": "អ្នកប្រើប្រាស់ត្រូវបានបង្កើតដោយជោគជ័យ។",
    "The user was successfully deleted.": "អ្នកប្រើប្រាស់ត្រូវបានលុបដោយជោគជ័យ។",
    "The user was successfully restored.": "អ្នកប្រើប្រាស់ត្រូវបានស្ដារដោយជោគជ័យ។",
    "The user was permanently deleted.": "អ្នកប្រើប្រាស់ត្រូវបានលុបចោលដោយជោគជ័យ។",
    "You can not set a password that you have previously used within the last :num times.": "អ្នកមិនអាចកំណត់ពាក្យសម្ងាត់ដែលបានប្រើប្រាស់មុននេះក្នុងការចុងក្រោយនៅពេលចុងក្រោយនេះទេ។",
    "Reset Password Notification": "ការផ្លាស់ប្តូរពាក្យសម្ងាត់",
    "You are receiving this email because we received a password reset request for your account.": "អ្នកទទួលនៅតែការអ៊ីមែលនេះដើម្បីបញ្ជាក់ទទួលបានការស្នើរសុំការផ្លាស់ប្តូរពាក្យសម្ងាត់សម្រាប់គណនីរបស់អ្នក។",
    "Reset Password": "កំណត់ពាក្យសម្ងាត់ឡើងវិញ",
    "This password reset link will expire in :count minutes.": "តំណភ្ជាប់កំណត់ពាក្យសម្ងាត់នេះនឹងផុតកំណត់នៅពេល :count នាទីមួយ។",
    "If you did not request a password reset, no further action is required.": "បើអ្នកមិនបានស្នើសុំការផ្លាស់ប្តូរពាក្យសម្ងាត់ទេ។ សកម្មភាពនេះមិនចាំបាច់បានទេ។",
    "Verify E-mail Address": "ផ្ទៀងផ្ទាត់អាសយដ្ឋានអ៊ីមែល",
    "Please click the button below to verify your email address.": "សូមចុចប៊ូតុងខាងក្រោមដើម្បីផ្ទៀងផ្ទាត់អាសយដ្ឋានអ៊ីមែលរបស់អ្នក។",
    "If you did not create an account, no further action is required.": "បើអ្នកមិនបានបង្កើតគណនីទេ សកម្មភាពនេះមិនចាំបាច់បានទេ។",
    "There was a problem creating the role.": "មានបញ្ហាក្នុងការបង្កើតតួនាទី។",
    "There was a problem updating the role.": "មានបញ្ហាក្នុងការបន្ទាន់សម័យតួនាទី។",
    "You can not delete a role with associated users.": "អ្នកមិនអាចលុបតួនាទីដែលមានអ្នកប្រើប្រាស់ត្រូវបានភ្ជាប់ទេ។",
    "There was a problem deleting the role.": "មានបញ្ហាក្នុងការលុបតួនាទី។",
    "There was a problem creating your account.": "មានបញ្ហាក្នុងការបង្កើតគណនីរបស់អ្នក។",
    "There was a problem connecting to :provider": "មានបញ្ហាក្នុងការតភ្ជាប់ទៅកាន់ :provider",
    "There was a problem creating this user. Please try again.": "មានបញ្ហាក្នុងការបង្កើតអ្នកប្រើប្រាស់នេះ។ សូមព្យាយាមម្ដងទៀត។",
    "There was a problem updating this user. Please try again.": "មានបញ្ហាក្នុងការបន្ទាន់សម័យអ្នកប្រើប្រាស់នេះ។ សូមព្យាយាមម្ដងទៀត។",
    "That is not your old password.": "អ្នកមិនបានបញ្ចូលពាក្យសម្ងាត់ចាស់ដែលអ្នកបានបង្កើតឡើងហើយ។",
    "You can not do that to yourself.": "អ្នកមិនអាចធ្វើនេះទៅខាងលើអ្នកដែលអ្នកបានបង្កើតឡើងហើយ។",
    "You can not deactivate the administrator account.": "អ្នកមិនអាចបិទបញ្ជាកម្មនៃគណនីអ្នកគ្រប់គ្រងប្រព័ន្ធប្រតិបត្តិការណ៍។",
    "You can not delete yourself.": "អ្នកមិនអាចលុបអ្នកដែលអ្នកបានបង្កើតឡើងហើយ។",
    "There was a problem restoring this user. Please try again.": "មានបញ្ហាក្នុងការស្ដារអ្នកប្រើប្រាស់នេះ។ សូមព្យាយាមម្ដងទៀត។",
    "There was a problem permanently deleting this user. Please try again.": "មានបញ្ហាក្នុងការលុបចេញពួកគេទៅសារពិចាររបស់អ្នកប្រើប្រាស់នេះ។ សូមព្យាយាមម្ដងទៀត។",
    "The requested resource was not found.": "រកមិនឃើញប្រភពដែលបានស្នើ។",
    "Type": "ប្រភេទ",
    "Name": "ឈ្មោះ",
    "Permissions": "សិទ្ធិ",
    "Number of Users": "ចំនួនអ្នកប្រើប្រាស់",
    "Actions": "ប្រតិបត្តិការ",
    "E-mail": "អ៊ីម៉ែល",
    "Verified": "បានបញ្ជាក់",
    "2FA": "2FA",
    "Roles": "តួនាទី",
    "Additional Permissions": "សិទ្ធិបន្ថែមផ្សេង",
    "Two Factor Authentication Successfully Enabled": "បានបើកប្រើប្រាស់ការបង្កើតសិទ្ធិពីពួកគេបានជោគជ័យ",
    "Your authorization code was invalid. Please try again.": "កូដសម្គាល់របស់អ្នកមិនត្រឹមត្រូវ។ សូមព្យាយាមម្ដងទៀត។",
    "You must confirm your new e-mail address before you can go any further.": "អ្នកត្រូវតែបញ្ជាក់អ៊ីម៉ែលរបស់អ្នកមុនពេលអ្នកអាចចូលទៅកាន់បន្ទាប់ពីនេះ។",
    "Profile successfully updated.": "បានធ្វើបច្ចុប្បន្នភាពទិន្នន័យរបស់អ្នកដោយជោគជ័យ។",
    "Dashboard": "ផ្ទាំងគ្រប់គ្រង",
    "Account": "គណនី",
    "Login": "ចូល",
    "Register": "ចុះឈ្មោះ",
    "Docs": "ឯកសារ",
    "E-mail Address": "អ៊ីម៉ែល",
    "Password": "ពាក្យសម្ងាត់",
    "Password Confirmation": "បញ្ជាក់ពាក្យសម្ងាត់",
    "I agree to the": "ខ្ញុំយល់ព្រម",
    "Terms & Conditions": "លក្ខខណ្ឌនិងសហគ្រិន",
    "Please confirm your password before continuing.": "សូមបញ្ជាក់ពាក្យសម្ងាត់របស់អ្នកមុនពេលបន្តទៅកាន់បន្ទាប់",
    "Confirm Password": "បញ្ជាក់ពាក្យសម្ងាត់",
    "Your password has expired.": "ពាក្យសម្ងាត់របស់អ្នកបានផុតកំណត់ហើយ។",
    "Current Password": "ពាក្យសម្ងាត់បច្ចុប្បន្ន",
    "New Password": "ពាក្យសម្ងាត់ថ្មី",
    "Update Password": "កែពាក្យសម្ងាត់",
    "Send Password Reset Link": "ផ្ញើការកែប្រែពាក្យសម្ងាត់",
    "Login with Bitbucket": "ចូលដោយ Bitbucket",
    "Login with Facebook": "ចូលដោយ Facebook",
    "Login with Google": "ចូលដោយ Google",
    "Login with Github": "ចូលដោយ Github",
    "Login with Linkedin": "ចូលដោយ Linkedin",
    "Login with Twitter": "ចូលដោយ Twitter",
    "Verify Your E-mail Address": "បញ្ជាក់អាសយដ្ឋានអ៊ីម៉ែលរបស់អ្នក",
    "Before proceeding, please check your email for a verification link.": "មុនពេលបន្តទៅកាន់បន្ទាប់អ្នកត្រូវតែពិនិត្យអាសយដ្ឋានអ៊ីម៉ែលរបស់អ្នកមុនពេលបន្តទៅកាន់បន្ទាប់។",
    "If you did not receive the email": "ប្រសិនបើអ្នកមិនទទួលបានអ៊ីម៉ែល",
    "click here to request another": "ចុចទីនេះដើម្បីស្នើមួយផ្សេងទៀត",
    "Remember Me": "ចងចាំខ្ញុំ",
    "Forgot Your Password?": "ភ្លេចពាក្យសម្ងាត់របស់អ្នក?",
    "Toggle navigation": "បិទបញ្ជូល",
    "Administration": "អភិបាល",
    "My Account": "គណនីរបស់ខ្ញុំ",
    "Logout": "ចេញ",
    "My Profile": "ពត៌មានរបស់ខ្ញុំ",
    "Edit Information": "កែពត៌មាន",
    "Two Factor Authentication": "ការផ្ទៀងផ្ទាត់ការបង្កើតពាក្យសម្ងាត់ច្រើន",
    "You are logged in!": "អ្នកបានកត់ឈ្មោះចូល!",
    "Two Factor Recovery Codes": "កូដស្វ័យប្រវត្តិច្រើន",
    "Save your two factor recovery codes:": "រក្សាទុកកូដស្វ័យប្រវត្តិច្រើនរបស់អ្នក៖",
    "Recovery codes are used to access your account in the event you no longer have access to your authenticator app.": "កូដស្វ័យប្រវត្តិច្រើននឹងត្រូវបានប្រើដើម្បីចូលទៅកាន់គណនីរបស់អ្នកនៅពេលអ្នកមិនមានកម្មវិធីបង្កើតពាក្យសម្ងាត់របស់អ្នកបានទេ។",
    "Generate New Backup Codes": "បង្កើតកូដស្វ័យប្រវត្តិច្រើនថ្មី",
    "Each code can only be used once!": "កូដនេះអាចត្រូវបានប្រើប្រាស់តែមួយប៉ុណ្ណោះ។",
    "Used": "បានប្រើ",
    "Not Used": "មិនប្រើ",
    "I have stored these codes in a safe place": "ខ្ញុំបានកត់ស្វាគមន៍នៅក្នុងកន្លែងជាចាំបាច់",
    "Enable Two Factor Authentication": "បើកការផ្ទៀងផ្ទាត់ការបង្កើតពាក្យសម្ងាត់ច្រើន",
    "Step 1: Configure your 2FA app": "ជំហាន 1: កំណត់ការការកំណត់កម្មវិធី 2FA",
    "Most applications will let you set up by scanning the QR code from within the app. If you prefer, you may type the key below the QR code in manually.": "កម្មវិធីដែលមានប្រភេទដែលអាចកំណត់ការការកំណត់កម្មវិធី 2FA នឹងអាចកំណត់ការកំណត់កម្មវិធីដោយស្វែងរក QR code ពីក្នុងកម្មវិធី។ ប្រសិនបើអ្នកចង់, អ្នកអាចសរសេរកូដក្នុងការកំណត់កម្មវិធីដោយស្វែងរក",
    "Step 2: Enter a 2FA code": "ជំហាន 2: បញ្ចូលកូដ 2FA",
    "Generate a code from your 2FA app and enter it below:": "បង្កើតកូដពីកម្មវិធី 2FA របស់អ្នក និងបញ្ចូលកូដខាងក្រោម៖",
    "Disable Two Factor Authentication": "បិទការផ្ទៀងផ្ទាត់ការបង្កើតពាក្យសម្ងាត់ច្រើន",
    "Authorization Code": "កូដសម្គាល់",
    "Remove Two Factor Authentication": "ដកការផ្ទៀងផ្ទាត់ការបង្កើតពាក្យសម្ងាត់ច្រើនចេញ",
    "New Password Confirmation": "ពាក្យសំងាត់ថ្មីម្តងទៀត",
    "If you change your e-mail you will be logged out until you confirm your new e-mail address.": "ប្រសិនបើអ្នកប្ដូរអ៊ីមែលរបស់អ្នក អ្នកនឹងត្រូវបានចេញពីប្រព័ន្ធដល់អ៊ីមែលថ្មីរបស់អ្នកដើម្បីបញ្ជាក់ទៅដើម្បីបញ្ជាក់ទៅដើម្បីបញ្ជាក់ទៅដើម្បីបញ្ជាក់ទៅដើម្បីបញ្ជាក់ទៅដើម្បីបញ្ជា",
    "Update": "កែប្រែ",
    "Two Factor Authentication is Enabled": "ការបង្កើតពាក្យសម្ងាត់ច្រើនត្រូវបានបើក",
    "View\/Regenerate Recovery Codes": "មើល\/បង្កើតកូដសម្គាល់ស្តាប់បញ្ជុលឡើងវិញ",
    "Two Factor Authentication is Disabled": "ការបង្កើតពាក្យសម្ងាត់ច្រើនត្រូវបានបិទ",
    "Avatar": "រូបភាព",
    "Social Provider": "អ្នកផ្គត់ផ្គង់សង្គម",
    "Timezone": "ល្វែងម៉ោង",
    "N\/A": "N \/ A",
    "Account Created": "គណនីត្រូវបានបង្កើត",
    "Last Updated": "កែសម្រួលចុងក្រោយ",
    "A fresh verification link has been sent to your email address.": "បញ្ជាក់ទទួលបានការផ្ទៀងផ្ទាត់តំណភ្ជាប់សម្រាប់អ៊ីមែលរបស់អ្នកបានបានបញ្ជាក់ទៅកាន់អ៊ីមែលរបស់អ្នក",
    "Thank you for verifying your e-mail address.": "សូមអរគុណសម្រាប់ការបញ្ជាក់ទទួលបានអ៊ីមែលរបស់អ្នក",
    "The Application is currently in read only mode. All requests other than GET are disabled.": "កម្មវិធីនេះកំពុងកំពុងក្នុងរបៀបអានប៉ុណ្ណោះ។ ការស្នើរបស់ទាំងអស់ដូចជា GET ត្រូវបានបិទក្នុងការប្រើប្រាស់។",
    "You are currently logged in as :name.": "អ្នកបានកត់ឈ្មោះចូលរបស់អ្នកជាមួយ៖ :name",
    "Return to your account": "ត្រឡប់ទៅកាន់គណនីរបស់អ្នក",
    "Role Management": "គ្រប់គ្រងតួនាទី",
    "Create Role": "បង្កើតតួនាទី",
    "There are no permissions to choose from.": "មិនមានសិទ្ធិដើម្បីជ្រើសរើសពីនេះទេ",
    "Administrator": "អ្នកគ្រប់គ្រង",
    "User": "អ្នកប្រើប្រាស់",
    "Update Role": "កែសម្រួលតួនាទី",
    "Cancel": "បោះបង់",
    "General Permissions": "សិទ្ធិទូទៅ",
    "Permission Categories": "ប្រភេទសិទ្ធិ",
    "There are no additional permissions to choose from for this type.": "មិនមានសិទ្ធិបន្ថែមដើម្បីជ្រើសរើសពីប្រភេទនេះទេ",
    "All Permissions": "សិទ្ធិ​ទាំងអស់",
    "No Permissions": "គ្មាន​សិទ្ធិ",
    "There are no roles to choose from for this type.": "មិនមានតួនាទីដើម្បីជ្រើសរើសពីប្រភេទនេះទេ",
    "User Management": "គ្រប់គ្រងអ្នកប្រើប្រាស់",
    "Create User": "បង្កើតអ្នកប្រើប្រាស់",
    "Active": "សកម្ម",
    "Inactive": "អសកម្ម",
    "Deactivated Users": "អ្នកប្រើប្រាស់​ដែល​បាន​បិទសកម្ម",
    "Deleted Users": "អ្នកប្រើប្រាស់ដែលត្រូវបានលុប",
    "Restore": "ទាញមកវិញ",
    "Permanently Delete": "លុបចោលរហូត",
    "Reactivate": "សកម្មភាពឡើងវិញ",
    "More": "ច្រើនទៀត",
    "Change Password": "ផ្លាស់ប្ដូរពាក្យសម្ងាត់",
    "Clear Session": "សំអាតការកត់ឈ្មោះ",
    "Deactivate": "អសកម្ម",
    "Yes": "បាទ\/ចាស",
    "No": "ទេ",
    "Update User": "កែប្រែអ្នកប្រើប្រាស់",
    "E-mail Verified": "អ៊ីម៉ែលត្រូវបានបញ្ជាក់",
    "Send Confirmation E-mail": "ផ្ញើអ៊ីម៉ែលការអនុញ្ញាត",
    "Change Password for :name": "ផ្លាស់ប្តូរពាក្យសង្ងាត់របស់ :name",
    "View User": "មើល​អ្នក​ប្រើប្រាស់",
    "Back": "ត្រឡប់",
    "Status": "ស្ថានភាព",
    "Last Login At": "ចូលប្រើចុងក្រោយនៅ",
    "Last Known IP Address": "អាសយដ្ឋាន IP ដែលបានស្គាល់ចុងក្រោយ",
    "Provider": "កម្មវិធីផ្ដល់ស្តាប់",
    "Provider ID": "លេខសម្គាល់កម្មវិធីផ្ដល់ស្តាប់",
    "Account Deleted": "គណនី​បាន​លុប​ចោល",
    "Copyright": "រក្សាសិទ្ធិ",
    "All Rights Reserved": "រក្សាសិទ្ធិទាំងអស់",
    "Powered by": "អភិបាលដោយ",
    "System": "ប្រព័ន្ធ",
    "Access": "អនុញ្ញាត",
    "Welcome :Name": "សូមស្វាគមន៍ :Name",
    "Welcome to the Dashboard": "ស្វាគមន៍ទៅកាន់ផ្ទាំងគ្រប់គ្រង",
    "Delete": "លុប",
    "Close": "បិទ",
    "Edit": "កែសម្រួូល",
    "View": "មើល",
    "You can not set a password that you have previously used within the last 3 times.": "អ្នក​មិន​អាច​កំណត់​ពាក្យសម្ងាត់​ដែល​បាន​ប្រើ​ចុងក្រោយ​នៅ​ក្នុង​ពេល​ចុងក្រោយ​នៅ​ចុង​ក្រោយ​១០០០។",
    "These credentials do not match our records.": "ពាក្យសម្គាល់​នេះ​មិន​ត្រូវ​គ្នា​ទៅ​ក្នុង​ការ​កំណត់​របស់​យើង។",
    "Editing :role": "កែសម្រួល :role",
    "Home": "ទំព័រដើម"
}
