{
    "The role was successfully created.": "บทบาทถูกสร้างสำเร็จแล้ว",
    "The role was successfully deleted.": "บทบาทถูกลบสำเร็จแล้ว",
    "The role was successfully updated.": "บทบาทถูกแก้ไขสำเร็จแล้ว",
    "A new confirmation e-mail has been sent to the address on file.": "อีเมลยืนยันตัวตนได้ถูกส่งไปยังปลายทางแล้ว",
    "The user was successfully created.": "ผู้ใช้ถูกสร้างสำเร็จแล้ว",
    "The user was successfully deleted.": "ผู้ใช้ถูกลบสำเร็จแล้ว",
    "The user was deleted permanently.": "ผู้ใช้ถูกลบไปอย่างถาวร",
    "The user was successfully restored.": "ผู้ใช้ถูกกู้คืนสำเร็จแล้ว",
    "The user was successfully updated.": "ผู้ใช้ถูกแก้ไขสำเร็จแล้ว",
    "The user´s password was successfully updated.": "รหัสผ่านของผู้ใช้ถูกแก้ไขสำเร็จแล้ว",
    "These credentials do not match our records.": "ข้อมูลที่ใช้ในการยืนยันตัวตนไม่ถูกต้อง",
    "You do not have access to do that.": "คุณไม่มีสิทธิ์ในการเข้าถึงหรือกระทำการ",
    ":provider is not an acceptable login type.": "ไม่ได้รับการยินยอมให้เข้าสู่ระบบด้วย :provider",
    "Too many login attempts. Please try again in :seconds seconds.": "คุณได้พยายามเข้าระบบหลายครั้งเกินไป กรุณาลองใหม่ใน :seconds วินาทีข้างหน้า",
    "An unknown error occurred": "เกิดข้อผิดพลาดโดยไม่ทราบสาเหตุ",
    "Activate": "เปิดใช้งาน",
    "Change Password": "เปลี่ยนรหัสผ่าน",
    "Deactivate": "พักการใช้งาน",
    "Delete Permanently": "ลบอย่างถาวร",
    "Login As :user": "เข้าสู่ระบบเสมือนเป็น :user",
    "Resend Confirmation E-mail": "ส่งอีเมลยืนยันตัวตนอีกครั้ง",
    "Restore User": "กู้คืนผู้ใช้",
    "Confirm Account": "ยืนยันบัญชี",
    "Reset Password": "ตั้งรหัสผ่านใหม่",
    "Cancel": "ยกเลิก",
    "Create": "สร้าง",
    "Delete": "ลบ",
    "Edit": "แก้ไข",
    "Update": "ปรับปรุง",
    "View": "แสดง",
    "Save": "บันทึก",
    "That role already exists. Please choose a different name.": "บทบาทนี้มีอยู่แล้ว กรุณาเลือกชื่ออื่นที่แตกต่าง",
    "You can not delete the Administrator role.": "คุณไม่สามารถลบบทบาทผู้ดูแลระบบได้",
    "There was a problem creating this role. Please try again.": "มีข้อผิดพลาดในการสร้างบทบาทนี้ กรุณาลองใหม่อีกครั้ง",
    "There was a problem deleting this role. Please try again.": "มีข้อผิดพลาดในการลบบทบาทนี้ กรุณาลองใหม่อีกครั้ง",
    "You can not delete a role with associated users.": "คุณไม่สามารถลบบทบาทที่มีผู้ใช้สวมบทบาทนี้อยู่",
    "You must select at least one permission for this role.": "คุณต้องเลือกอย่างน้อยหนึ่งสิทธิ์ให้กับบทบาทนี้",
    "That role does not exist.": "ไม่พบบทบาทนี้",
    "There was a problem updating this role. Please try again.": "มีข้อผิดพลาดในการแก้ไขบทบาทนี้ กรุณาลองใหม่อีกครั้ง",
    "You can not do that to yourself.": "คุณไม่สามารถกระทำกับตนเองได้",
    "You can not delete yourself.": "คุณไม่สามารถลบตนเองได้",
    "This user is not deleted so it can not be restored.": "ผู้ใช้นี้ไม่สามารถทำการลบได้ เนื่องจากไม่สามารถจะกู้คืนผู้ใช้นี้ได้",
    "There was a problem creating this user. Please try again.": "มีข้อผิดพลาดในการสร้างผู้ใช้นี้ กรุณาลองใหม่อีกครั้ง",
    "There was a problem deleting this user. Please try again.": "มีข้อผิดพลาดในการลบผู้ใช้นี้ กรุณาลองใหม่อีกครั้ง",
    "This user must be deleted first before it can be destroyed permanently.": "ผู้ใช้นี้ต้องทำการลบออกไปก่อน ก่อนที่จะทำการทำลบทื้งอย่างถาวร",
    "That email address belongs to a different user.": "อีเมลนี้เป็นของผู้ใช้คนอื่น",
    "There was a problem updating this user. Please try again.": "มีข้อผิดพลาดในการแก้ไขผู้ใช้นี้ กรุณาลองใหม่อีกครั้ง",
    "That user does not exist.": "ไม่พบผู้ใช้นี้",
    "There was a problem restoring this user. Please try again.": "มีข้อผิดพลาดในการกู้คืนผู้ใช้นี้ กรุณาลองใหม่อีกครั้ง",
    "You must choose at lease one role.": "คุณต้องเลือกอย่างน้อยหนึ่งบทบาท",
    "You must choose at least one role.": "คุณต้องเลือกอย่างน้อยหนึ่งบทบาท",
    "There was a problem changing this users password. Please try again.": "มีข้อผิดพลาดในการเปลี่ยนรหัสผ่านของผู้ใช้นี้ กรุณาลองใหม่อีกครั้ง",
    "Your account is already confirmed.": "บัญชีผู้ใช้ของคุณได้รับการยืนยันแล้ว",
    "Confirm your account!": "ยีนยันบัญชีผู้ใช้ของคุณ!",
    "Your account was successfully created. We have sent you an e-mail to confirm your account.": "บัญชีผู้ใช้ของคุณถูกสร้างสำเร็จแล้ว ระบบได้ส่งอีเมลสำหรับยืนยันตัวตนให้คุณ",
    "Your confirmation code does not match.": "รหัสที่ใช้ยืนยันตัวตนไม่ถูกต้อง",
    "That confirmation code does not exist.": "ไม่พบรหัสที่ใช้ยืนยันตัวตนนี้",
    "Your account is not confirmed. Please click the confirmation link in your e-mail, or <a href=\"http://localhost/account/confirm/resend/:user_id\">click here</a> to resend the confirmation e-mail.": "บัญชีผู้ใช้ของคุณยังไม่ได้รับการยืนยันตัวตน กรุณาคลิกลิงก์ในอีเมลของคุณ หรือ <a href=\"http://localhost/account/confirm/resend/:user_id\">คลิกที่นี่</a> เพื่อส่งอีเมลยืนยันตัวตนอีกครั้ง",
    "Your account has been successfully confirmed!": "บัญชีผู้ใช้ของคุณได้รับการยืนยันตัวตนสำเร็จแล้ว!",
    "Your account has been deactivated.": "บัญชีผู้ใช้ของคุณถูกพักการใช้งาน",
    "That e-mail address is already taken.": "อีเมลนี้ถูกใช้ในระบบแล้ว",
    "That is not your old password.": "รหัสผ่านเดิมไม่ถูกต้อง",
    "There is no recent history.": "ไม่มีประวัติล่าสุด",
    "There is no history for this type.": "ไม่มีประวัติประเภทนี้",
    "There is no history for this :entity.": "ไม่มีประวัติสำหรับ :entity นี้",
    "Recent History": "ประวัติล่าสุด",
    "created role": "ได้สร้างบทบาท",
    "deleted role": "ได้ลบบทบาท",
    "updated role": "ได้แก้ไขบทบาท",
    "changed password for user": "ได้เปลี่ยนรหัสผ่านของผู้ใช้",
    "created user": "ได้สร้างผู้ใช้",
    "deactivated user": "ได้พักการใช้งานของผู้ใช้",
    "deleted user": "ได้ลบผู้ใช้",
    "permanently deleted user": "ได้ลบผู้ใช้อย่างถาวร",
    "updated user": "ได้แก้ไขผู้ใช้",
    "reactivated user": "ได้เปิดการใช้งานของผู้ใช้",
    "restored user": "ได้กู้คืนผู้ใช้",
    "Page Not Found": "ไม่พบหน้า",
    "Sorry, but the page you were trying to view does not exist.": "ขออภัย ไม่พบหน้าทึ่คุณต้องการ",
    "Be right back.": "เราจะกลับมาในไม่ช้า",
    "All": "ทั้งหมด",
    "Yes": "ใช่",
    "No": "ไม่",
    "Custom": "เลือกเอง",
    "Actions": "การกระทำ",
    "Active": "ใช้งาน",
    "Hide": "ซ่อน",
    "Inactive": "ไม่ใช้งาน",
    "None": "ไม่มี",
    "Show": "แสดง",
    "Toggle Navigation": "เปิด/ปิด เมนูนำทาง",
    "Create Role": "สร้างบทบาท",
    "Edit Role": "แก้ไขบทบบาท",
    "Role Management": "การจัดการบทบาท",
    "Number of Users": "จำนวนผู้ใช้",
    "Permissions": "สิทธิ์",
    "Role": "บทบาท",
    "Sort": "เรียงตาม",
    "role total|roles total": "บทบาททั้งหมด|บทบาททั้งหมด",
    "Active Users": "ผู้ใช้",
    "All Permissions": "สิทธิ์ทั้งหมด",
    "Change Password for :user": "เปลี่ยนรหัสผ่านสำหรับ :user",
    "Create User": "สร้างผู้ใช้",
    "Deactivated Users": "ผู้ใช้ที่ถูกพักการใช้งาน",
    "Deleted Users": "ผู้ใช้ที่ถูกลบ",
    "Edit User": "แก้ไขผู้ใช้",
    "User Management": "การจัดการผู้ใช้",
    "No Permissions": "ไม่มีสิทธิ์",
    "No Roles to set.": "ไม่มีบทบาทให้เลือก",
    "Confirmed": "ยืนยันแล้ว",
    "Created": "สร้างเมื่อ",
    "E-mail": "อีเมล",
    "ID": "ID",
    "Last Updated": "อัพเดทล่าสุดเมื่อ",
    "Name": "ชื่อ",
    "No Deactivated Users": "ไม่มีผู้ใช้ที่ถูกพักการใช้งาน",
    "No Deleted Users": "ไม่มีผู้ใช้ที่ถูกลบ",
    "Roles": "บทบาท",
    "user total|users total": "ผู้ใช้ทั้งหมด|ผู้ใช้ทั้งหมด",
    "Overview": "ภาพรวม",
    "History": "ประวัติ",
    "Avatar": "รูปตัวแทน",
    "Created At": "สร้างแล้วเมื่อ",
    "Deleted At": "ลบแล้วเมื่อ",
    "Status": "สถานะ",
    "View User": "แสดงผู้ใช้",
    "Login": "เข้าสู่ระบบ",
    "Login with :social_media": "เข้าสู่ระบบด้วย :social_media",
    "Register": "ลงทะเบียน",
    "Remember Me": "จดจำฉัน",
    "Forgot Your Password?": "ลืมรหัสผ่าน?",
    "Send Password Reset Link": "ส่งลิงก์สำหรับรีเซ็ตรหัสผ่าน",
    "Country Alpha Codes": "รหัสประเทศชนิดตัวอักษร",
    "Country Alpha 2 Codes": "รหัสประเทศชนิดสองตัวอักษร",
    "Country Alpha 3 Codes": "รหัสประเทศชนิดสามตัวอักษร",
    "Country Numeric Codes": "รหัสประเทศชนิดตัวเลข",
    "Macro Examples": "ตัวอย่าง มาโคร",
    "Mexico State List": "รายชื่อรัฐในเม็กซิโก",
    "US States": "รัฐในสหรัฐอเมริกา",
    "US Outlying Territories": "อาณาเขตรอบนอกของสหรัฐ",
    "US Armed Forces": "กองทัพสหรัฐ",
    "Canada Province & Territories List": "จังหวัดและอาณาเขตของแคนาดา",
    "Timezone": "เขตเวลา",
    "Edit Information": "แก้ไขข้อมูล",
    "Update Information": "ปรับปรุงข้อมูล",
    "Access Management": "การจัดการผู้ใช้และสิทธิ์",
    "All Roles": "บทบาททั้งหมด",
    "All Users": "ผู้ใช้ทั้งหมด",
    "Users": "ผู้ใช้",
    "Log Viewer": "แสดงข้อมูล Log",
    "Dashboard": "แผงควบคุม",
    "Logs": "รายการล็อก",
    "General": "ทั่วไป",
    "System": "ระบบ",
    "Language": "ภาษา",
    "Arabic": "อารบิก (Arabic)",
    "Danish": "เดนมา์ก (Danish)",
    "German": "เยอรมัน (German)",
    "Greek": "(Greek)",
    "English": "อังกฤษ (English)",
    "Spanish": "สเปน (Spanish)",
    "French": "ฝรั่งเศส (French)",
    "Indonesian": "ชาวอินโดนีเซีย (Indonesian)",
    "Italian": "อิตาลี (Italian)",
    "Dutch": "ดัตช์ (Dutch)",
    "Brazilian Portuguese": "โปรตุเกสแบบบราซิล (Brazilian Portuguese)",
    "Swedish": "สวีเดน (Swedish)",
    "Thai": "ไทย (Thai)",
    "Home": "หน้าแรก",
    "Logout": "ออกจากระบบ",
    "Macros": "Macros",
    "My Account": "บัญชีของฉัน",
    "Administration": "หน้าแอดมิน",
    "My Information": "ข้อมูลของฉัน",
    "Profile": "ข้อมูลส่วนตัว",
    "&laquo; Previous": "&laquo; ก่อนหน้า",
    "Next &raquo;": "ถัดไป &raquo;",
    "Passwords must be at least six characters and match the confirmation.": "รหัสผ่านต้องมีความยาวอย่างน้อยหกตัวอักษรและต้องตรงกับช่องยืนยันรหัสผ่าน",
    "Your password has been reset!": "ทำการตั้งค่ารหัสผ่านใหม่แล้ว!",
    "We have e-mailed your password reset link!": "ระบบได้ส่งอีเมลสำหรับตั้งรหัสผ่านใหม่ให้คุณแล้ว!",
    "This password reset token is invalid.": "ชุดรหัสสำหรับการเปลี่ยนรหัสผ่านไม่ถูกต้อง",
    "We can't find a user with that e-mail address.": "ไม่พบผู้ใช้งานที่ตรงกับอีเมล์นี้",
    "Administrator": "แอดมิน",
    "User": "ผู้ใช้",
    "Are you sure you want to delete this user permanently? Anywhere in the application that references this user's id will most likely error. Proceed at your own risk. This can not be un-done.": "คุณแน่ใจว่าต้องการลบผู้ใช้นี้อย่างถาวร? ทุกที่ในระบบที่อ้างอิงถึงผู้ใช้นี้อาจเกิดข้อผิดพลาด ดำเนินการต่อด้วยการตัดสินใจของคุณเอง และการกระทำนี้ไม่สามารถย้อนกลับได้",
    "(If confirmed is off)": "(ถ้าหากการยืนยันตัวตนไม่ถูกเลือก)",
    "Restore this user to its original state?": "ต้องการกู้คืนผู้ใช้นี้กลับสู่สถานะดั้งเดิม?",
    "Administrative Dashboard": "แผงควบคุมแอดมิน",
    "Welcome": "ยินดีต้อนรับ",
    "All Rights Reserved.": "ขอสงวนสิทธิ์",
    "Are you sure?": "คุณแน่ใจหรือ?",
    "Laravel 5 Boilerplate": "Laravel 5 Boilerplate",
    "Continue": "ทำต่อ",
    "Member since": "เป็นสมาชิกตั้งแต่",
    " minutes": " นาที",
    "Search...": "ค้นหา...",
    "You were automatically logged out for security reasons since you had no activity in ": "คุณถูกทำให้ออกจากระบบโดยอัตโนมัติเพื่อความปลอดภัย เนื่องจากไม่มีความเคลื่อนไหวใดๆ เกิดขึ้นใน ",
    "See all messages": "ดูข้อความทั้งหมด",
    "View all": "ดูทั้งหมด",
    "View all tasks": "ดูภารกิจทั้งหมด",
    "Online": "ออนไลน์",
    "Offline": "ออฟไลน์",
    "{0} You don't have messages|{1} You have 1 message|[2,Inf] You have :number messages": "{0} คุณไม่มีข้อความใดๆ|{1} คุณมี 1 ข้อความ|[2,Inf] คุณมี :number ข้อความ",
    "{0} You don't have notifications|{1} You have 1 notification|[2,Inf] You have :number notifications": "{0} คุณไม่มีการแจ้งเตือนใดๆ|{1} คุณมี 1 การแจ้งเตือน|[2,Inf] คุณมี :number การแจ้งเตือน",
    "{0} You don't have tasks|{1} You have 1 task|[2,Inf] You have :number tasks": "{0} คุณไม่มีภารกิจใดๆ|{1} คุณมี 1 ภารกิจ|[2,Inf] คุณมี :number ภารกิจ",
    "Please enter a search term.": "กรุณาป้อนคำสืบค้น",
    "You must write your own search logic for this system.": "สำหรับระบบนี้คุณต้องเขียนเงื่อนไขสำหรับการสืบค้นด้วยตัวเอง",
    "Search Results": "ผลการสืบค้น",
    "Search Results for :query": "ผลการสืบค้นสำหรับ :query",
    "<p>This is the AdminLTE theme by <a href=\"https://almsaeedstudio.com/\" target=\"_blank\">https://almsaeedstudio.com/</a>. This is a stripped down version with only the necessary styles and scripts to get it running. Download the full version to start adding components to your dashboard.</p>\n<p>All the functionality is for show with the exception of the <strong>Access Management</strong> to the left. This boilerplate comes with a fully functional access control library to manage users/roles/permissions.</p>\n<p>Keep in mind it is a work in progress and their may be bugs or other issues I have not come across. I will do my best to fix them as I receive them.</p>\n<p>Hope you enjoy all of the work I have put into this. Please visit the <a href=\"https://github.com/rappasoft/laravel-5-boilerplate\" target=\"_blank\">GitHub</a> page for more information and report any <a href=\"https://github.com/rappasoft/Laravel-5-Boilerplate/issues\" target=\"_blank\">issues here</a>.</p>\n<p><strong>This project is very demanding to keep up with given the rate at which the master Laravel branch changes, so any help is appreciated.</strong></p>\n<p>- Anthony Rappa</p>": "<p>นี่คือธีม AdminLTE โดย <a href=\"https://almsaeedstudio.com/\" target=\"_blank\">https://almsaeedstudio.com/</a> ซึ่งเป็นเวอร์ชั่นตัดทอน เหลือสไตล์ชีทและสคริปต์ที่จำเป็น คุณสามารถดาวน์โหลดเวอร์ชั่นเต็มเพิ่มเติม เพื่อเพิ่มคอมโพเนนท์ให้กับแผงควบคุม</p>\n<p>การทำงานทั้งหมดเป็นเพียงตัวอย่าง ยกเว้น<strong>การจัดการผู้ใช้</strong>ทางด้านซ้าย Laravel 5 Boilerplate มาพร้อมกับไลบรารี่เต็มรูปแบบเพื่อควบคุมและจัดการ ผู้ใช้/บทบาท/สิทธิ์</p>\n<p>โปรดระลึกว่านี่เป็นงานที่อยู่ระหว่างการพัฒนา และอาจเกิดบั๊กหรือข้อผิดพลาดอื่นๆที่ยังไม่ถูกค้นพบ เมื่อรับทราบ ทางทีมงานจะทำเต็มที่เพื่อแก้ไขปัญหาที่เกิดขึ้น</p>\n<p>หวังว่าคุณจะได้รับประโยชน์จากผลงานทั้งหมดนี้ที่ทางทีมงานทุ่มเทสร้างขึ้น กรุณาเยี่ยมชมหน้าของ <a href=\"https://github.com/rappasoft/laravel-5-boilerplate\" target=\"_blank\">GitHub</a> เพื่อข้อมูลเพิ่มเติมและ <a href=\"https://github.com/rappasoft/Laravel-5-Boilerplate/issues\" target=\"_blank\">รายงานข้อผิดพลาด</a> ได้ที่นี่</p>\n<p><strong>โปรเจคนี้ต้องการการดูแลอัพเดทอย่างสม่ำเสมอ เนื่องด้วยการเปลี่ยนแปลงและพัฒนาของ master branch ของ Laravel Framework ดังนั้นทางทีมงานยินดีอย่างยิ่ง หากได้รับการช่วยเหลือ</strong></p>\n<p>- Anthony Rappa</p>",
    "Whoops!": "โอ้วววว!",
    "Hello!": "สวัสดีจ้า!",
    "Regards,": "ด้วยความนับถือ,",
    "If you’re having trouble clicking the \":action_text\" button, copy and paste the URL below into your web browser:": "เมื่อคุณมีปัญหาในการคลิกปุ่ม \":action_text\" , โปรดคัดลอก URL ด้านล่างแล้วนำไปวางในเว็บบราวเซอร์ของคุณ:",
    "Thank you for using our application!": "ขอบคุณมากสำหรับการใช้งานแอพพลิเคชั่นของเรา",
    "You are receiving this email because we received a password reset request for your account.": "คุณได้รับอีเมลฉบับนี้เนื่องจากมีการร้องขอการตั้งรหัสผ่านใหม่สำหรับบัญชีผู้ใช้นี้",
    "If you did not request a password reset, no further action is required.": "ถ้าหากว่าคุณไม่ได้เป็นคนร้องขอการตั้งรหัสผ่านใหม่ ไม่จำเป็นต้องทำสิ่งใดเพิ่มเติม",
    "Click here to reset your password": "คลิกที่นี่เพื่อรีเซ็ตรหัสผ่านของคุณ",
    "Click here to confirm your account:": "คลิกที่นี่เพื่อยืนยันตัวตนของคุณ:",
    "Test": "การทดสอบ",
    "Permission Based - ": "เกี่ยวกับสิทธิ์ - ",
    "Role Based - ": "เกี่ยวกับบทบาท - ",
    "Javascript Injected from a Controller": "ใส่ Javascript ผ่าน Controller",
    "Using Blade Extensions": "การใช้ Blade Extensions",
    "Using Access Helper with Array of Permission Names or ID's where the user does have to possess all.": "ใช้ Access Helper กับ Array ของชื่อสิทธิ์ หรือ ID ซึ่งผู้ใช้ต้องเป็นผู้ที่มีสิทธิ์ครบทั้งหมด",
    "Using Access Helper with Array of Permission Names or ID's where the user does not have to possess all.": "ใช้ Access Helper กับ Array ของชื่อสิทธิ์ หรือ ID ซึ่งผู้ใช้ไม่จำเป็นต้องเป็นผู้ที่มีสิทธิ์ครบทั้งหมด",
    "Using Access Helper with Array of Role Names or ID's where the user does have to possess all.": "ใช้ Access Helper กับ Array ของชื่อบทบาท หรือ ID ซึ่งผู้ใช้ต้องเป็นผู้ที่มีบทบาทครบทั้งหมด",
    "Using Access Helper with Array of Role Names or ID's where the user does not have to possess all.": "ใช้ Access Helper กับ Array ของชื่อบทบาท หรือ ID ซึ่งผู้ใช้ไม่จำเป็นต้องเป็นผู้ที่มีบทบาทครบทั้งหมด",
    "Using Access Helper with Permission ID": "ใช้ Access Helper กับ ID ของสิทธิ์",
    "Using Access Helper with Permission Name": "ใช้ Access Helper กับชื่อของสิทธิ์",
    "Using Access Helper with Role ID": "ใช้ Access Helper กับ ID ของบทบาท",
    "Using Access Helper with Role Name": "ใช้ Access Helper กับชื่อของบทบาท",
    "View console, you should see 'it works!' which is coming from FrontendController@index": "ดูที่คอนโซลล็อก คุณจะเห็นข้อความ 'it works!' ซึ่งมาจาก FrontendController@index",
    "You can see this because you have the role of ':role'!": "คุณสามารถเห็นข้อความนี้เนื่องจากคุณมีบทบาทของ ':role'!",
    "You can see this because you have the permission of ':permission'!": "คุณสามารถเห็นข้อความนี้เนื่องจากคุณมีสิทธิ์ของ ':permission'!",
    "Profile successfully updated.": "ข้อมูลโปรไฟล์ถูกอัพเดทสำเร็จแล้ว",
    "Password successfully updated.": "รหัสผ่านถูกอัพเดทสำเร็จแล้ว",
    "Welcome to :place": "ยินดีต้อนรับสู่ :place",
    "The :attribute must be accepted.": "ข้อมูล :attribute ต้องผ่านการยอมรับก่อน",
    "The :attribute is not a valid URL.": "ข้อมูล :attribute ต้องเป็น URL เท่านั้น",
    "The :attribute must be a date after :date.": "ข้อมูล :attribute ต้องเป็นวันที่หลังจาก :date",
    "The :attribute must be a date after or equal to :date.": "ข้อมูล :attribute ต้องเป็นวันที่หลังหรือเท่ากันกับ :date.",
    "The :attribute may only contain letters.": "ข้อมูล :attribute ต้องเป็นตัวอักษรภาษาอังกฤษเท่านั้น",
    "The :attribute may only contain letters, numbers, and dashes.": "ข้อมูล :attribute ต้องเป็นตัวอักษรภาษาอังกฤษ ตัวเลข และ _ เท่านั้น",
    "The :attribute may only contain letters and numbers.": "ข้อมูล :attribute ต้องเป็นตัวอักษรภาษาอังกฤษ ตัวเลข เท่านั้น",
    "The :attribute must be an array.": "ข้อมูล :attribute ต้องเป็นอาเรย์เท่านั้น",
    "The :attribute must be a date before :date.": "ข้อมูล :attribute ต้องเป็นวันที่ก่อน :date",
    "The :attribute must be a date before or equal to :date.": "ข้อมูล :attribute ต้องเป็นวันที่ก่อนหรือเท่ากันกับวันที่ :date.",
    "The :attribute must be between :min and :max.": "ข้อมูล :attribute ต้องอยู่ในช่วงระหว่าง :min - :max",
    "The :attribute must be between :min and :max kilobytes.": "ข้อมูล :attribute ต้องอยู่ในช่วงระหว่าง :min - :max กิโลไบต์",
    "The :attribute must be between :min and :max characters.": "ข้อมูล :attribute ต้องอยู่ในช่วงระหว่าง :min - :max ตัวอักษร",
    "The :attribute must have between :min and :max items.": "ข้อมูล :attribute ต้องอยู่ในช่วงระหว่าง :min - :max ค่า",
    "The :attribute field must be true or false.": "ข้อมูล :attribute ต้องเป็นจริง หรือเท็จ เท่านั้น",
    "The :attribute confirmation does not match.": "ข้อมูล :attribute ไม่ตรงกัน",
    "The :attribute is not a valid date.": "ข้อมูล :attribute ต้องเป็นวันที่",
    "The :attribute does not match the format :format.": "ข้อมูล :attribute ไม่ตรงกับข้อมูลกำหนด :format",
    "The :attribute and :other must be different.": "ข้อมูล :attribute และ :other ต้องไม่เท่ากัน",
    "The :attribute must be :digits digits.": "ข้อมูล :attribute ต้องเป็น :digits",
    "The :attribute must be between :min and :max digits.": "ข้อมูล :attribute ต้องอยู่ในช่วงระหว่าง :min ถึง :max",
    "The :attribute has invalid image dimensions.": "รูปภาพ :attribute มีขนาดไม่ถูกต้อง",
    "The :attribute field has a duplicate value.": "ข้อมูล :attribute มีค่าที่ซ้ำกัน",
    "The :attribute must be a valid email address.": "ข้อมูล :attribute ต้องเป็นอีเมล์",
    "The selected :attribute is invalid.": "ข้อมูล ที่ถูกเลือกจาก :attribute ไม่ถูกต้อง",
    "The :attribute must be a file.": "ข้อมูล :attribute ต้องเป็นไฟล์",
    "The :attribute field is required.": "ข้อมูล :attribute จำเป็นต้องกรอก",
    "The :attribute must be an image.": "ข้อมูล :attribute ต้องเป็นรูปภาพ",
    "The :attribute field does not exist in :other.": "ข้อมูล :attribute ไม่มีอยู่ภายในค่าของ :other",
    "The :attribute must be an integer.": "ข้อมูล :attribute ต้องเป็นตัวเลข",
    "The :attribute must be a valid IP address.": "ข้อมูล :attribute ต้องเป็น IP",
    "The :attribute must be a valid JSON string.": "ข้อมูล :attribute ต้องเป็นอักขระ JSON ที่สมบูรณ์",
    "The :attribute may not be greater than :max.": "ข้อมูล :attribute ต้องมีจำนวนไม่เกิน :max",
    "The :attribute may not be greater than :max kilobytes.": "ข้อมูล :attribute ต้องมีจำนวนไม่เกิน :max กิโลไบต์",
    "The :attribute may not be greater than :max characters.": "ข้อมูล :attribute ต้องมีจำนวนไม่เกิน :max ตัวอักษร",
    "The :attribute may not have more than :max items.": "ข้อมูล :attribute ต้องมีจำนวนไม่เกิน :max ค่า",
    "The :attribute must be a file of type: :values.": "ข้อมูล :attribute ต้องเป็นชนิดไฟล์: :values",
    "The :attribute must be at least :min.": "ข้อมูล :attribute ต้องมีจำนวนอย่างน้อย :min",
    "The :attribute must be at least :min kilobytes.": "ข้อมูล :attribute ต้องมีจำนวนอย่างน้อย :min กิโลไบต์",
    "The :attribute must be at least :min characters.": "ข้อมูล :attribute ต้องมีจำนวนอย่างน้อย :min ตัวอักษร",
    "The :attribute must have at least :min items.": "ข้อมูล :attribute ต้องมีจำนวนอย่างน้อย :min ค่า",
    "The :attribute must be a number.": "ข้อมูล :attribute ต้องเป็นตัวเลข",
    "The :attribute field must be present.": "ข้อมูล :attribute ต้องเป็นปัจจุบัน",
    "The :attribute format is invalid.": "ข้อมูล :attribute มีรูปแบบไม่ถูกต้อง",
    "The :attribute field is required when :other is :value.": "ข้อมูล :attribute จำเป็นต้องกรอกเมื่อ :other เป็น :value",
    "The :attribute field is required unless :other is in :values.": "ข้อมูล :attribute จำเป็นต้องกรอกเว้นแต่ :other เป็น :values",
    "The :attribute field is required when :values is present.": "ข้อมูล :attribute จำเป็นต้องกรอกเมื่อ :values มีค่า",
    "The :attribute field is required when :values is not present.": "ข้อมูล :attribute จำเป็นต้องกรอกเมื่อ :values ไม่มีค่า",
    "The :attribute field is required when none of :values are present.": "ข้อมูล :attribute จำเป็นต้องกรอกเมื่อ :values ไม่มีค่าทั้งหมด",
    "The :attribute and :other must match.": "ข้อมูล :attribute และ :other ต้องถูกต้อง",
    "The :attribute must be :size.": "ข้อมูล :attribute ต้องเท่ากับ :size",
    "The :attribute must be :size kilobytes.": "ข้อมูล :attribute ต้องเท่ากับ :size กิโลไบต์",
    "The :attribute must be :size characters.": "ข้อมูล :attribute ต้องเท่ากับ :size ตัวอักษร",
    "The :attribute must contain :size items.": "ข้อมูล :attribute ต้องเท่ากับ :size ค่า",
    "The :attribute must be a string.": "ข้อมูล :attribute ต้องเป็นอักขระ",
    "The :attribute must be a valid zone.": "ข้อมูล :attribute ต้องเป็นข้อมูลเขตเวลาที่ถูกต้อง",
    "The :attribute has already been taken.": "ข้อมูล :attribute ไม่สามารถใช้ได้",
    "custom-message": "custom-message",
    "Associated Roles": "บทบาทที่เกี่ยวข้อง",
    "Dependencies": "สิ่งที่จำเป็นต้องมี",
    "Display Name": "ชื่อที่แสดง",
    "Group": "กลุ่ม",
    "Group Sort": "เรียงตามกลุ่ม",
    "Group Name": "ชื่อกลุ่ม",
    "System?": "ระบบ?",
    "Associated Permissions": "สิทธิ์ที่เกี่ยวข้อง",
    "E-mail Address": "ที่อยู่อีเมล",
    "Other Permissions": "สิทธิ์อื่นๆ",
    "Password": "รหัสผ่าน",
    "Password Confirmation": "ยืนยันรหัสผ่าน",
    "Send Confirmation E-mail": "ส่งอีเมลยืนยันตัวตน",
    "Old Password": "รหัสผ่านเดิม",
    "New Password": "รหัสผ่านใหม่",
    "New Password Confirmation": "ยืนยันรหัสผ่านใหม่",
    "The :attribute failed to upload.": null,
    "Activeren": null,
    "Verander Wachtwoord": null,
    "Deactiveren": null,
    "Permanent verwijderen": null,
    "Aanmelden als :user": null,
    "Bevestigings email nogmaals zenden": null,
    "Gebruiker herstellen": null,
    "Account Bevestigen": null,
    "Reset Wachtwoord": null,
    "Annuleer": null,
    "Creëer": null,
    "Verwijder": null,
    "Aanpassen": null,
    "Bijwerken": null,
    "Bekijk": null,
    "Opslaan": null
}