{
    "Access": "เข้าไป",
    "Account": "บัญชีผู้ใช้",
    "Account Created": "สร้างบัญชีแล้ว",
    "Account Deleted": "บัญชีถูกลบ",
    "Active": "คล่องแคล่ว",
    "Administration": "การบริหาร",
    "A fresh verification link has been sent to your email address.": "ลิงก์ยืนยันใหม่ถูกส่งไปยังที่อยู่อีเมลของคุณ",
    "All Permissions": "สิทธิ์ทั้งหมด",
    "All Rights Reserved": "สงวนลิขสิทธิ์",
    "Avatar": "สัญลักษณ์",
    "Back": "กลับ",
    "Before proceeding, please check your email for a verification link.": "ก่อนดำเนินการต่อโปรดตรวจสอบลิงก์การยืนยันของคุณทางอีเมล",
    "Cancel": "ยกเลิก",
    "Change Password": "เปลี่ยนรหัสผ่าน",
    "Change Password for :name": "เปลี่ยนรหัสผ่านสำหรับ :name",
    "Changing Password for :user": "การเปลี่ยนรหัสผ่านสำหรับ :user",
    "Clear Session": "ล้างเซสชัน",
    "click here to request another": "คลิกที่นี่เพื่อขออีก",
    "Close": "ปิด",
    "Confirm Password": "ยืนยันรหัสผ่าน",
    "Copyright": "ลิขสิทธิ์",
    "Create Role": "สร้างบทบาท",
    "Create User": "สร้างผู้ใช้งาน",
    "Current Password": "รหัสผ่านปัจจุบัน",
    "Dashboard": "แผงควบคุม",
    "Deactivate": "ปิดใช้งาน",
    "Deactivated Users": "ผู้ใช้ที่ไม่ได้ใช้งาน",
    "Delete": "ลบ",
    "Deleted Users": "ผู้ใช้ที่ถูกลบ",
    "Docs": "เอกสาร",
    "E-mail Address": "ที่อยู่อีเมล",
    "E-mail Verified": "ยืนยันอีเมลแล้ว",
    "Edit": "แก้ไข",
    "Edit Information": "แก้ไขข้อมูล",
    "Editing :role": "กำลังแก้ไข :role",
    "Editing :user": "กำลังแก้ไข :user",
    "Forgot Your Password?": "ลืมรหัสผ่านหรือไม่?",
    "General Permissions": "สิทธิ์ทั่วไป",
    "Home": "บ้าน",
    "If you change your e-mail you will be logged out until you confirm your new e-mail address.": "หากคุณเปลี่ยนอีเมลของคุณคุณจะออกจากระบบจนกว่าคุณจะยืนยันที่อยู่อีเมลใหม่ของคุณ",
    "If you did not create an account, no further action is required.": "หากคุณไม่ได้สร้างบัญชีคุณไม่จำเป็นต้องดำเนินการใด ๆ อีก",
    "If you did not receive the email": "หากคุณไม่ได้รับอีเมล",
    "If you did not request a password reset, no further action is required.": "หากคุณไม่ได้ร้องขอการรีเซ็ตรหัสผ่านคุณไม่จำเป็นต้องดำเนินการใด ๆ อีก",
    "Inactive": "เฉื่อยชา",
    "Laravel Boilerplate": "หม้อไอน้ำ Laravel",
    "Last Known IP Address": "ที่อยู่ IP ที่ทราบล่าสุด",
    "Last Login At": "เข้าสู่ระบบล่าสุดเมื่อ",
    "Last Updated": "อัปเดตล่าสุด",
    "Login": "เข้าสู่ระบบ",
    "Login with Bitbucket": "เข้าสู่ระบบด้วย Bitbucket",
    "Login with Facebook": "เข้าสู่ระบบด้วย Facebook",
    "Login with Github": "เข้าสู่ระบบด้วย Github",
    "Login with Google": "เข้าสู่ระบบด้วย Google",
    "Login with Linkedin": "เข้าสู่ระบบด้วย Linkedin",
    "Login with Twitter": "เข้าสู่ระบบด้วย Twitter",
    "Logout": "ออกจากระบบ",
    "My Account": "บัญชีของฉัน",
    "My Profile": "ประวัติของฉัน",
    "Name": "ชื่อ",
    "New Password": "รหัสผ่านใหม่",
    "New Password Confirmation": "ใหม่ยืนยันรหัสผ่าน",
    "No": "ไม่",
    "No Permissions": "ไม่มีสิทธิ์",
    "N\/A": "N \/ A",
    "Only the administrator can change their password.": "ผู้ดูแลระบบเท่านั้นที่สามารถเปลี่ยนรหัสผ่านของพวกเขา",
    "Only the administrator can update this user.": "มีเพียงผู้ดูแลระบบเท่านั้นที่สามารถอัปเดตผู้ใช้นี้",
    "Password": "รหัสผ่าน",
    "Password Confirmation": "การยืนยันรหัสผ่าน",
    "Password successfully updated.": "อัปเดตรหัสผ่านสำเร็จแล้ว",
    "Permanently Delete": "ลบอย่างถาวร",
    "Permission Categories": "ประเภทการอนุญาต",
    "Permissions": "สิทธิ์",
    "Please click the button below to verify your email address.": "โปรดคลิกปุ่มด้านล่างเพื่อยืนยันที่อยู่อีเมลของคุณ",
    "Please confirm your password before continuing.": "โปรดยืนยันรหัสผ่านของคุณก่อนดำเนินการต่อ",
    "Powered by": "ขับเคลื่อนโดย",
    "Profile successfully updated.": "อัปเดตโปรไฟล์สำเร็จแล้ว",
    "Provider": "ผู้ให้บริการ",
    "Provider ID": "ID ผู้ให้บริการ",
    "Register": "สมัครสมาชิก",
    "Remember Me": "จดจำฉัน",
    "Reset Password": "รีเซ็ตรหัสผ่าน",
    "Reset Password Notification": "รีเซ็ตการแจ้งเตือนรหัสผ่าน",
    "Restore": "ฟื้นฟู",
    "Role Management": "การจัดการบทบาท",
    "Roles": "บทบาท",
    "Send Confirmation E-mail": "ส่งอีเมลยืนยัน",
    "Send Password Reset Link": "ส่งลิงค์รีเซ็ตรหัสผ่าน",
    "Social Provider": "ผู้ให้บริการทางสังคม",
    "Status": "สถานะ",
    "System": "ระบบ",
    "Thank you for verifying your e-mail address.": "ขอบคุณสำหรับการยืนยันที่อยู่อีเมลของคุณ",
    "That is not your old password.": "นั่นไม่ใช่รหัสผ่านเก่าของคุณ",
    "The Application is currently in read only mode. All requests other than GET are disabled.": "แอปพลิเคชันอยู่ในโหมดอ่านอย่างเดียว คำขอทั้งหมดนอกเหนือจาก GET ถูกปิดใช้งาน",
    "There are no permissions to choose from.": "ไม่มีสิทธิ์ให้เลือก",
    "There are no roles to choose from.": "ไม่มีบทบาทให้เลือก",
    "The requested resource was not found.": "ไม่พบทรัพยากรที่ร้องขอ",
    "There was a problem connecting to :provider": "มีปัญหาในการเชื่อมต่อกับ :provider",
    "There was a problem creating the role.": "เกิดปัญหาในการสร้างบทบาท",
    "There was a problem creating this user. Please try again.": "เกิดปัญหาในการสร้างผู้ใช้รายนี้ กรุณาลองอีกครั้ง.",
    "There was a problem creating your account.": "มีปัญหาในการสร้างบัญชีของคุณ",
    "There was a problem permanently deleting this user. Please try again.": "มีปัญหาในการลบผู้ใช้รายนี้อย่างถาวร กรุณาลองอีกครั้ง.",
    "There was a problem restoring this user. Please try again.": "มีปัญหาในการกู้คืนผู้ใช้รายนี้ กรุณาลองอีกครั้ง.",
    "There was a problem updating the role.": "เกิดปัญหาในการอัปเดตบทบาท",
    "There was a problem updating this user. Please try again.": "เกิดปัญหาในการอัปเดตผู้ใช้รายนี้ กรุณาลองอีกครั้ง.",
    "The role was successfully created.": "สร้างบทบาทสำเร็จแล้ว",
    "The role was successfully deleted.": "ลบบทบาทสำเร็จแล้ว",
    "The role was successfully updated.": "อัปเดตบทบาทเรียบร้อยแล้ว",
    "The user was permanently deleted.": "ผู้ใช้ถูกลบอย่างถาวร",
    "The user was successfully created.": "สร้างผู้ใช้สำเร็จแล้ว",
    "The user was successfully deleted.": "ผู้ใช้ถูกลบเรียบร้อยแล้ว",
    "The user was successfully restored.": "กู้คืนผู้ใช้สำเร็จแล้ว",
    "The user was successfully updated.": "อัปเดตผู้ใช้สำเร็จแล้ว",
    "This password reset link will expire in :count minutes.": "ลิงก์รีเซ็ตรหัสผ่านนี้จะหมดอายุในเวลา :count นาที",
    "This user is already deleted.": "ผู้ใช้รายนี้ถูกลบแล้ว",
    "This user is not deleted so it can not be permanently deleted.": "ผู้ใช้นี้จะไม่ถูกลบดังนั้นจึงไม่สามารถลบได้อย่างถาวร",
    "This user is not deleted so it can not be restored.": "ผู้ใช้นี้ไม่ถูกลบดังนั้นจึงไม่สามารถกู้คืนได้",
    "Timezone": "เขตเวลา",
    "Toggle navigation": "ไม่ต้องสลับช่องทาง",
    "Update": "ปรับปรุง",
    "Update Password": "อัปเดตรหัสผ่าน",
    "Update Role": "ปรับปรุงบทบาท",
    "Update User": "อัปเดตผู้ใช้",
    "User Management": "การจัดการผู้ใช้",
    "Verified": "ตรวจสอบแล้ว",
    "Verify E-mail Address": "ยืนยันที่อยู่อีเมล",
    "Verify Your E-mail Address": "ยืนยันที่อยู่อีเมลของคุณ",
    "View": "ดู",
    "Viewing :user": "กำลังดู :user",
    "View User": "ดูผู้ใช้",
    "Welcome :Name": "ยินดีต้อนรับ :Name",
    "Welcome to the Dashboard": "ยินดีต้อนรับสู่แดชบอร์ด",
    "Yes": "ใช่",
    "You are logged in!": "คุณเข้าสู่ระบบ!",
    "You are receiving this email because we received a password reset request for your account.": "คุณได้รับอีเมลนี้เนื่องจากเราได้รับคำขอรีเซ็ตรหัสผ่านสำหรับบัญชีของคุณ",
    "You can not clear your own session.": "คุณไม่สามารถล้างเซสชั่นของคุณเอง",
    "You can not deactivate the administrator account.": "คุณไม่สามารถปิดใช้งานบัญชีผู้ดูแลระบบได้",
    "You can not delete a role with associated users.": "คุณไม่สามารถลบบทบาทกับผู้ใช้ที่เกี่ยวข้องได้",
    "You can not delete the Administrator role.": "คุณไม่สามารถลบบทบาทผู้ดูแลระบบได้",
    "You can not delete the master administrator.": "คุณไม่สามารถลบผู้ดูแลระบบหลัก",
    "You can not delete yourself.": "คุณไม่สามารถลบตัวเอง",
    "You can not do that to yourself.": "คุณไม่สามารถทำเช่นนั้นกับตัวเอง",
    "You can not edit the Administrator role.": "คุณไม่สามารถแก้ไขบทบาทผู้ดูแลระบบ",
    "You can not set a password that you have previously used within the last :num times.": "คุณไม่สามารถตั้งรหัสผ่านที่คุณเคยใช้ในช่วง :num ครั้งล่าสุด",
    "You do not have access to do that.": "คุณไม่สามารถเข้าถึงได้",
    "You must confirm your new e-mail address before you can go any further.": "คุณต้องยืนยันที่อยู่อีเมลใหม่ของคุณก่อนจึงจะสามารถดำเนินการต่อไปได้",
    "You must select one or more roles.": "คุณต้องเลือกอย่างน้อยหนึ่งบทบาท",
    "Your account has been deactivated.": "บัญชีของคุณถูกปิดการใช้งาน",
    "Your password has expired.": "รหัสผ่านของคุณหมดอายุ",
    "Your password has expired. We require you to change your password every :days days for security purposes.": "รหัสผ่านของคุณหมดอายุ เราต้องการให้คุณเปลี่ยนรหัสผ่านทุก ๆ 1 วันเพื่อความปลอดภัย"
}
