{
    "Your password has expired. We require you to change your password every :days days for security purposes.": "รหัสผ่านของคุณหมดอายุ เราต้องการให้คุณเปลี่ยนรหัสผ่านทุก ๆ 1 วันเพื่อความปลอดภัย",
    "You do not have access to do that.": "คุณไม่สามารถเข้าถึงได้",
    "Two-factor Authentication must be :status to view this page.": "การรับรองความถูกต้องด้วยสองปัจจัยต้องเป็น :status เพื่อดูหน้านี้",
    "One or more permissions were not found or are not allowed to be associated with this role type.": "ไม่พบสิทธิ์หนึ่งรายการขึ้นไปหรือไม่ได้รับอนุญาตให้เชื่อมโยงกับประเภทบทบาทนี้",
    "You can not edit the Administrator role.": "คุณไม่สามารถแก้ไขบทบาทผู้ดูแลระบบ",
    "You can not delete the Administrator role.": "คุณไม่สามารถลบบทบาทผู้ดูแลระบบได้",
    "Only the administrator can change their password.": "ผู้ดูแลระบบเท่านั้นที่สามารถเปลี่ยนรหัสผ่านของพวกเขา",
    "One or more roles were not found or are not allowed to be associated with this user type.": "ไม่พบบทบาทอย่างน้อยหนึ่งบทบาทหรือไม่ได้รับอนุญาตให้เชื่อมโยงกับผู้ใช้ประเภทนี้",
    "One or more permissions were not found or are not allowed to be associated with this user type.": "ไม่พบการอนุญาตหนึ่งรายการขึ้นไปหรือไม่ได้รับอนุญาตให้เชื่อมโยงกับผู้ใช้ประเภทนี้",
    "Only the administrator can update this user.": "มีเพียงผู้ดูแลระบบเท่านั้นที่สามารถอัปเดตผู้ใช้นี้",
    "You can not delete the master administrator.": "คุณไม่สามารถลบผู้ดูแลระบบหลัก",
    "You can not clear your own session.": "คุณไม่สามารถล้างเซสชั่นของคุณเอง",
    "Your account has been deactivated.": "บัญชีของคุณถูกปิดการใช้งาน",
    "Password successfully updated.": "อัปเดตรหัสผ่านสำเร็จแล้ว",
    "Two Factor Authentication Successfully Disabled": "ปิดใช้งานการรับรองความถูกต้องสองระดับสำเร็จแล้ว",
    "You must accept the Terms & Conditions.": "คุณต้องยอมรับข้อกำหนดและเงื่อนไข",
    "Any old backup codes have been invalidated.": "รหัสสำรองเก่าใด ๆ ไม่ถูกต้อง",
    "Two Factor Recovery Codes Regenerated": "สร้างรหัสกู้คืนตัวประกอบสองตัว",
    "The role was successfully created.": "สร้างบทบาทสำเร็จแล้ว",
    "The role was successfully updated.": "อัปเดตบทบาทเรียบร้อยแล้ว",
    "The role was successfully deleted.": "ลบบทบาทสำเร็จแล้ว",
    "The user was successfully updated.": "อัปเดตผู้ใช้สำเร็จแล้ว",
    "The user was successfully created.": "สร้างผู้ใช้สำเร็จแล้ว",
    "The user was successfully deleted.": "ผู้ใช้ถูกลบเรียบร้อยแล้ว",
    "The user was successfully restored.": "กู้คืนผู้ใช้สำเร็จแล้ว",
    "The user was permanently deleted.": "ผู้ใช้ถูกลบอย่างถาวร",
    "You can not set a password that you have previously used within the last :num times.": "คุณไม่สามารถตั้งรหัสผ่านที่คุณเคยใช้ในช่วง :num ครั้งล่าสุด",
    "Reset Password Notification": "รีเซ็ตการแจ้งเตือนรหัสผ่าน",
    "You are receiving this email because we received a password reset request for your account.": "คุณได้รับอีเมลนี้เนื่องจากเราได้รับคำขอรีเซ็ตรหัสผ่านสำหรับบัญชีของคุณ",
    "Reset Password": "รีเซ็ตรหัสผ่าน",
    "This password reset link will expire in :count minutes.": "ลิงก์รีเซ็ตรหัสผ่านนี้จะหมดอายุในเวลา :count นาที",
    "If you did not request a password reset, no further action is required.": "หากคุณไม่ได้ร้องขอการรีเซ็ตรหัสผ่านคุณไม่จำเป็นต้องดำเนินการใด ๆ อีก",
    "Verify E-mail Address": "ยืนยันที่อยู่อีเมล",
    "Please click the button below to verify your email address.": "โปรดคลิกปุ่มด้านล่างเพื่อยืนยันที่อยู่อีเมลของคุณ",
    "If you did not create an account, no further action is required.": "หากคุณไม่ได้สร้างบัญชีคุณไม่จำเป็นต้องดำเนินการใด ๆ อีก",
    "There was a problem creating the role.": "เกิดปัญหาในการสร้างบทบาท",
    "There was a problem updating the role.": "เกิดปัญหาในการอัปเดตบทบาท",
    "You can not delete a role with associated users.": "คุณไม่สามารถลบบทบาทกับผู้ใช้ที่เกี่ยวข้องได้",
    "There was a problem deleting the role.": "มีปัญหาในการลบบทบาท",
    "There was a problem creating your account.": "มีปัญหาในการสร้างบัญชีของคุณ",
    "There was a problem connecting to :provider": "มีปัญหาในการเชื่อมต่อกับ :provider",
    "There was a problem creating this user. Please try again.": "เกิดปัญหาในการสร้างผู้ใช้รายนี้ กรุณาลองอีกครั้ง.",
    "There was a problem updating this user. Please try again.": "เกิดปัญหาในการอัปเดตผู้ใช้รายนี้ กรุณาลองอีกครั้ง.",
    "That is not your old password.": "นั่นไม่ใช่รหัสผ่านเก่าของคุณ",
    "You can not do that to yourself.": "คุณไม่สามารถทำเช่นนั้นกับตัวเอง",
    "You can not deactivate the administrator account.": "คุณไม่สามารถปิดใช้งานบัญชีผู้ดูแลระบบได้",
    "You can not delete yourself.": "คุณไม่สามารถลบตัวเอง",
    "There was a problem restoring this user. Please try again.": "มีปัญหาในการกู้คืนผู้ใช้รายนี้ กรุณาลองอีกครั้ง.",
    "There was a problem permanently deleting this user. Please try again.": "มีปัญหาในการลบผู้ใช้รายนี้อย่างถาวร กรุณาลองอีกครั้ง.",
    "The requested resource was not found.": "ไม่พบทรัพยากรที่ร้องขอ",
    "Type": "ชนิด",
    "Name": "ชื่อ",
    "Permissions": "สิทธิ์",
    "Number of Users": "จำนวนผู้ใช้",
    "Actions": "การปฏิบัติ",
    "E-mail": "E-mail",
    "Verified": "ตรวจสอบแล้ว",
    "2FA": "2FA",
    "Roles": "บทบาท",
    "Additional Permissions": "สิทธิ์เพิ่มเติม",
    "Two Factor Authentication Successfully Enabled": "เปิดใช้งานการรับรองความถูกต้องสองระดับสำเร็จแล้ว",
    "Your authorization code was invalid. Please try again.": "รหัสการอนุญาตของคุณไม่ถูกต้อง กรุณาลองอีกครั้ง.",
    "You must confirm your new e-mail address before you can go any further.": "คุณต้องยืนยันที่อยู่อีเมลใหม่ของคุณก่อนจึงจะสามารถดำเนินการต่อไปได้",
    "Profile successfully updated.": "อัปเดตโปรไฟล์สำเร็จแล้ว",
    "Dashboard": "แผงควบคุม",
    "Account": "บัญชีผู้ใช้",
    "Login": "เข้าสู่ระบบ",
    "Register": "สมัครสมาชิก",
    "Docs": "เอกสาร",
    "E-mail Address": "ที่อยู่อีเมล",
    "Password": "รหัสผ่าน",
    "Password Confirmation": "การยืนยันรหัสผ่าน",
    "I agree to the": "ฉันเห็นด้วยกับ",
    "Terms & Conditions": "ข้อตกลงและเงื่อนไข",
    "Please confirm your password before continuing.": "โปรดยืนยันรหัสผ่านของคุณก่อนดำเนินการต่อ",
    "Confirm Password": "ยืนยันรหัสผ่าน",
    "Your password has expired.": "รหัสผ่านของคุณหมดอายุ",
    "Current Password": "รหัสผ่านปัจจุบัน",
    "New Password": "รหัสผ่านใหม่",
    "Update Password": "อัปเดตรหัสผ่าน",
    "Send Password Reset Link": "ส่งลิงค์รีเซ็ตรหัสผ่าน",
    "Login with Bitbucket": "เข้าสู่ระบบด้วย Bitbucket",
    "Login with Facebook": "เข้าสู่ระบบด้วย Facebook",
    "Login with Google": "เข้าสู่ระบบด้วย Google",
    "Login with Github": "เข้าสู่ระบบด้วย Github",
    "Login with Linkedin": "เข้าสู่ระบบด้วย Linkedin",
    "Login with Twitter": "เข้าสู่ระบบด้วย Twitter",
    "Verify Your E-mail Address": "ยืนยันที่อยู่อีเมลของคุณ",
    "Before proceeding, please check your email for a verification link.": "ก่อนดำเนินการต่อโปรดตรวจสอบลิงก์การยืนยันของคุณทางอีเมล",
    "If you did not receive the email": "หากคุณไม่ได้รับอีเมล",
    "click here to request another": "คลิกที่นี่เพื่อขออีก",
    "Remember Me": "จดจำฉัน",
    "Forgot Your Password?": "ลืมรหัสผ่านหรือไม่?",
    "Toggle navigation": "ไม่ต้องสลับช่องทาง",
    "Administration": "การบริหาร",
    "My Account": "บัญชีของฉัน",
    "Logout": "ออกจากระบบ",
    "My Profile": "ประวัติของฉัน",
    "Edit Information": "แก้ไขข้อมูล",
    "Two Factor Authentication": "การรับรองความถูกต้องของสองปัจจัย",
    "You are logged in!": "คุณเข้าสู่ระบบ!",
    "Two Factor Recovery Codes": "รหัสกู้คืนสองปัจจัย",
    "Save your two factor recovery codes:": "บันทึกรหัสกู้คืนสองปัจจัยของคุณ:",
    "Recovery codes are used to access your account in the event you no longer have access to your authenticator app.": "รหัสกู้คืนใช้ในการเข้าถึงบัญชีของคุณในกรณีที่คุณไม่สามารถเข้าถึงแอพตัวตรวจสอบสิทธิ์ของคุณได้อีกต่อไป",
    "Generate New Backup Codes": "สร้างรหัสสำรองใหม่",
    "Each code can only be used once!": "แต่ละรหัสสามารถใช้ได้ครั้งเดียวเท่านั้น!",
    "Used": "มือสอง",
    "Not Used": "ไม่ได้ใช้",
    "I have stored these codes in a safe place": "ฉันเก็บรหัสเหล่านี้ไว้ในที่ปลอดภัยแล้ว",
    "Enable Two Factor Authentication": "เปิดใช้งานการรับรองความถูกต้องของสองปัจจัย",
    "Step 1: Configure your 2FA app": "ขั้นตอนที่ 1: กำหนดค่าแอป 2FA ของคุณ",
    "Most applications will let you set up by scanning the QR code from within the app. If you prefer, you may type the key below the QR code in manually.": "แอปพลิเคชั่นส่วนใหญ่จะให้คุณตั้งค่าโดยสแกนรหัส QR จากภายในแอป หากคุณต้องการคุณสามารถพิมพ์รหัสด้านล่างรหัส QR ด้วยตนเอง",
    "Step 2: Enter a 2FA code": "ขั้นตอนที่ 2: ป้อนรหัส 2FA",
    "Generate a code from your 2FA app and enter it below:": "สร้างรหัสจากแอป 2FA ของคุณและป้อนด้านล่าง:",
    "Disable Two Factor Authentication": "ปิดใช้งานการรับรองความถูกต้องสองระดับ",
    "Authorization Code": "รหัสอนุมัติ",
    "Remove Two Factor Authentication": "ลบการรับรองความถูกต้องของสองปัจจัย",
    "New Password Confirmation": "ใหม่ยืนยันรหัสผ่าน",
    "If you change your e-mail you will be logged out until you confirm your new e-mail address.": "หากคุณเปลี่ยนอีเมลของคุณคุณจะออกจากระบบจนกว่าคุณจะยืนยันที่อยู่อีเมลใหม่ของคุณ",
    "Update": "ปรับปรุง",
    "Two Factor Authentication is Enabled": "มีการเปิดใช้งานการรับรองความถูกต้องสองระดับ",
    "View\/Regenerate Recovery Codes": "ดู \/ สร้างรหัสกู้คืน",
    "Two Factor Authentication is Disabled": "การรับรองความถูกต้องของสองปัจจัยถูกปิดใช้งาน",
    "Avatar": "สัญลักษณ์",
    "Social Provider": "ผู้ให้บริการทางสังคม",
    "Timezone": "เขตเวลา",
    "N\/A": "N \/ A",
    "Account Created": "สร้างบัญชีแล้ว",
    "Last Updated": "อัปเดตล่าสุด",
    "A fresh verification link has been sent to your email address.": "ลิงก์ยืนยันใหม่ถูกส่งไปยังที่อยู่อีเมลของคุณ",
    "Thank you for verifying your e-mail address.": "ขอบคุณสำหรับการยืนยันที่อยู่อีเมลของคุณ",
    "The Application is currently in read only mode. All requests other than GET are disabled.": "แอปพลิเคชันอยู่ในโหมดอ่านอย่างเดียว คำขอทั้งหมดนอกเหนือจาก GET ถูกปิดใช้งาน",
    "You are currently logged in as :name.": "คุณกำลังเข้าสู่ระบบในฐานะ :name",
    "Return to your account": "กลับสู่บัญชีของคุณ",
    "Role Management": "การจัดการบทบาท",
    "Create Role": "สร้างบทบาท",
    "There are no permissions to choose from.": "ไม่มีสิทธิ์ให้เลือก",
    "Administrator": "ผู้บริหาร",
    "User": "ผู้ใช้งาน",
    "Update Role": "ปรับปรุงบทบาท",
    "Cancel": "ยกเลิก",
    "General Permissions": "สิทธิ์ทั่วไป",
    "Permission Categories": "ประเภทการอนุญาต",
    "There are no additional permissions to choose from for this type.": "ไม่มีสิทธิ์เพิ่มเติมให้เลือกสำหรับประเภทนี้",
    "All Permissions": "สิทธิ์ทั้งหมด",
    "No Permissions": "ไม่มีสิทธิ์",
    "There are no roles to choose from for this type.": "ไม่มีบทบาทให้เลือกสำหรับประเภทนี้",
    "User Management": "การจัดการผู้ใช้",
    "Create User": "สร้างผู้ใช้งาน",
    "Active": "คล่องแคล่ว",
    "Inactive": "เฉื่อยชา",
    "Deactivated Users": "ผู้ใช้ที่ไม่ได้ใช้งาน",
    "Deleted Users": "ผู้ใช้ที่ถูกลบ",
    "Restore": "ฟื้นฟู",
    "Permanently Delete": "ลบอย่างถาวร",
    "Reactivate": "เปิดใช้",
    "More": "มากกว่า",
    "Change Password": "เปลี่ยนรหัสผ่าน",
    "Clear Session": "ล้างเซสชัน",
    "Deactivate": "ปิดใช้งาน",
    "Yes": "ใช่",
    "No": "ไม่",
    "Update User": "อัปเดตผู้ใช้",
    "E-mail Verified": "ยืนยันอีเมลแล้ว",
    "Send Confirmation E-mail": "ส่งอีเมลยืนยัน",
    "Change Password for :name": "เปลี่ยนรหัสผ่านสำหรับ :name",
    "View User": "ดูผู้ใช้",
    "Back": "กลับ",
    "Status": "สถานะ",
    "Last Login At": "เข้าสู่ระบบล่าสุดเมื่อ",
    "Last Known IP Address": "ที่อยู่ IP ที่ทราบล่าสุด",
    "Provider": "ผู้ให้บริการ",
    "Provider ID": "ID ผู้ให้บริการ",
    "Account Deleted": "บัญชีถูกลบ",
    "Copyright": "ลิขสิทธิ์",
    "All Rights Reserved": "สงวนลิขสิทธิ์",
    "Powered by": "ขับเคลื่อนโดย",
    "System": "ระบบ",
    "Access": "เข้าไป",
    "Welcome :Name": "ยินดีต้อนรับ :Name",
    "Welcome to the Dashboard": "ยินดีต้อนรับสู่แดชบอร์ด",
    "Delete": "ลบ",
    "Close": "ปิด",
    "Edit": "แก้ไข",
    "View": "ดู",
    "You can not set a password that you have previously used within the last 3 times.": "คุณไม่สามารถตั้งรหัสผ่านที่คุณเคยใช้ภายใน 3 ครั้งล่าสุด",
    "These credentials do not match our records.": "ข้อมูลรับรองเหล่านี้ไม่ตรงกับบันทึกของเรา",
    "Editing :role": "กำลังแก้ไข :role",
    "Home": "บ้าน"
}