{
    "Your password has expired. We require you to change your password every :days days for security purposes.": "Mật khẩu của bạn đã hết hạn. Chúng tôi yêu cầu bạn thay đổi mật khẩu của bạn mỗi :days ngày đối với các mục đích an ninh.",
    "You do not have access to do that.": "Bạn không có quyền truy cập để làm điều đó.",
    "Two-factor Authentication must be :status to view this page.": "Hai yếu tố xác thực phải là :status để xem trang này.",
    "One or more permissions were not found or are not allowed to be associated with this role type.": "Một hoặc nhiều điều khoản không được tìm thấy hoặc không được phép có liên quan với loại vai trò này.",
    "You can not edit the Administrator role.": "Bạn không thể chỉnh sửa vai trò Administrator.",
    "You can not delete the Administrator role.": "Bạn không thể xóa vai trò Administrator.",
    "Only the administrator can change their password.": "Chỉ người quản trị có thể thay đổi mật khẩu của họ.",
    "One or more roles were not found or are not allowed to be associated with this user type.": "Một hoặc nhiều vai trò không được tìm thấy hoặc không được phép có liên quan đến loại người dùng này.",
    "One or more permissions were not found or are not allowed to be associated with this user type.": "Một hoặc nhiều điều khoản không được tìm thấy hoặc không được phép có liên quan đến loại người dùng này.",
    "Only the administrator can update this user.": "Chỉ người quản trị có thể cập nhật người dùng này.",
    "You can not delete the master administrator.": "Bạn không thể xóa người quản trị tổng thể.",
    "You can not clear your own session.": "Bạn không thể xóa phiên của riêng bạn.",
    "Your account has been deactivated.": "Tài khoản của bạn đã bị vô hiệu hoá.",
    "Password successfully updated.": "Mật khẩu được cập nhật thành công.",
    "Two Factor Authentication Successfully Disabled": "Two Factor Authentication vô hiệu hóa thành",
    "You must accept the Terms & Conditions.": "Bạn phải chấp nhận các Điều khoản và điều kiện.",
    "Any old backup codes have been invalidated.": "Bất kỳ mã sao lưu cũ đã không còn giá trị.",
    "Two Factor Recovery Codes Regenerated": "Two Factor Phục hồi Codes tái sinh",
    "The role was successfully created.": "Vai trò được tạo thành công.",
    "The role was successfully updated.": "Vai trò đã được cập nhật thành công.",
    "The role was successfully deleted.": "Vai trò đã được xóa thành công.",
    "The user was successfully updated.": "Người dùng đã được cập nhật thành công.",
    "The user was successfully created.": "Người dùng đã được tạo thành công.",
    "The user was successfully deleted.": "Người dùng đã được xóa thành công.",
    "The user was successfully restored.": "Người dùng đã được khôi phục thành công.",
    "The user was permanently deleted.": "Người dùng đã bị xóa vĩnh viễn.",
    "You can not set a password that you have previously used within the last :num times.": "Bạn không thể thiết lập một mật khẩu mà trước đó bạn đã sử dụng trong lần cuối :num num.",
    "Reset Password Notification": "Reset Password Thông báo",
    "You are receiving this email because we received a password reset request for your account.": "Bạn đang nhận email này vì chúng tôi nhận được yêu cầu thiết lập lại mật khẩu cho tài khoản của bạn.",
    "Reset Password": "Đặt lại mật khẩu",
    "This password reset link will expire in :count minutes.": "Thiết lập lại liên kết mật khẩu này sẽ hết hạn sau :count phút.",
    "If you did not request a password reset, no further action is required.": "Nếu bạn không yêu cầu một thiết lập lại mật khẩu, không có thêm hành động là bắt buộc.",
    "Verify E-mail Address": "Xác nhận địa chỉ email",
    "Please click the button below to verify your email address.": "Xin vui lòng bấm vào nút dưới đây để xác minh địa chỉ email của bạn.",
    "If you did not create an account, no further action is required.": "Nếu bạn không tạo một tài khoản, không có thêm hành động là bắt buộc.",
    "There was a problem creating the role.": "Có một vấn đề tạo ra vai trò.",
    "There was a problem updating the role.": "Có một vấn đề cập nhật vai trò.",
    "You can not delete a role with associated users.": "Bạn không thể xóa một vai trò với người sử dụng đi kèm.",
    "There was a problem deleting the role.": "Có một vấn đề xóa vai trò.",
    "There was a problem creating your account.": "Có một vấn đề tạo tài khoản của bạn.",
    "There was a problem connecting to :provider": "Có một vấn đề kết nối với :provider",
    "There was a problem creating this user. Please try again.": "Có một vấn đề tạo người dùng này. Vui lòng thử lại.",
    "There was a problem updating this user. Please try again.": "Có một vấn đề cập nhật của thành viên này. Vui lòng thử lại.",
    "That is not your old password.": "Đó không phải là mật khẩu cũ của bạn.",
    "You can not do that to yourself.": "Bạn không thể làm điều đó cho chính mình.",
    "You can not deactivate the administrator account.": "Bạn không thể tắt các tài khoản quản trị viên.",
    "You can not delete yourself.": "Bạn không thể xóa chính mình.",
    "There was a problem restoring this user. Please try again.": "Có một vấn đề khôi phục người dùng này. Vui lòng thử lại.",
    "There was a problem permanently deleting this user. Please try again.": "Có một vấn đề xóa vĩnh viễn thành viên này. Vui lòng thử lại.",
    "The requested resource was not found.": "Tài nguyên được yêu cầu không được tìm thấy.",
    "Type": "Kiểu",
    "Name": "Tên",
    "Permissions": "Quyền",
    "Number of Users": "Số lượng người dùng",
    "Actions": "Hoạt động",
    "E-mail": "E-mail",
    "Verified": "đã kích hoạt",
    "Roles": "vai trò",
    "2FA": "2FA",
    "Additional Permissions": "Quyền bổ sung",
    "Two Factor Authentication Successfully Enabled": "Two Factor Authentication Enabled thành công",
    "Your authorization code was invalid. Please try again.": "đang uỷ quyền của bạn không hợp lệ. Vui lòng thử lại.",
    "You must confirm your new e-mail address before you can go any further.": "Bạn phải xác nhận địa chỉ e-mail mới của bạn trước khi bạn có thể đi xa hơn.",
    "Profile successfully updated.": "Hồ sơ được cập nhật thành công.",
    "Dashboard": "bảng điều khiển",
    "Account": "Tài khoản",
    "Login": "Đăng nhập",
    "Register": "Đăng ký",
    "Docs": "Documents",
    "E-mail Address": "Địa chỉ email",
    "Password": "Mật khẩu",
    "Password Confirmation": "Xác nhận mật khẩu",
    "I agree to the": "tôi đồng ý với",
    "Terms & Conditions": "Điều khoản và điều kiện",
    "Please confirm your password before continuing.": "Vui lòng xác nhận mật khẩu của bạn trước khi tiếp tục.",
    "Confirm Password": "Xác nhận mật khẩu",
    "Your password has expired.": "Mật khẩu của bạn đã hết hạn.",
    "Current Password": "Mật khẩu hiện tại",
    "New Password": "mật khẩu mới",
    "Update Password": "cập nhật Mật khẩu",
    "Send Password Reset Link": "Gửi mật khẩu Đặt lại liên kết",
    "Login with Bitbucket": "Đăng nhập với Bitbucket",
    "Login with Facebook": "Đăng nhập Facebook",
    "Login with Google": "Đăng nhập với Google",
    "Login with Github": "Đăng nhập với Github",
    "Login with Linkedin": "Đăng nhập với Linkedin",
    "Login with Twitter": "Đăng nhập với Twitter",
    "Verify Your E-mail Address": "Xác nhận của bạn Địa chỉ E-mail",
    "Before proceeding, please check your email for a verification link.": "Trước khi tiếp tục, hãy kiểm tra email của bạn để liên kết xác minh.",
    "If you did not receive the email": "Nếu bạn không nhận được email",
    "click here to request another": "bấm vào đây để yêu cầu khác",
    "Remember Me": "Ghi nhớ",
    "Forgot Your Password?": "Quên mật khẩu?",
    "Toggle navigation": "Chuyển đổi điều hướng thành",
    "Administration": "Quản trị",
    "My Account": "Tài khoản của tôi",
    "Logout": "Đăng xuất",
    "My Profile": "Thông tin của tôi",
    "Edit Information": "chỉnh sửa thông tin",
    "Two Factor Authentication": "Two Factor Authentication",
    "You are logged in!": "Bạn đã đăng nhập!",
    "Two Factor Recovery Codes": "Two Factor Phục hồi Codes",
    "Save your two factor recovery codes:": "Lưu hai mã phục hồi yếu tố của bạn:",
    "Recovery codes are used to access your account in the event you no longer have access to your authenticator app.": "mã phục hồi được sử dụng để truy cập vào tài khoản của bạn trong trường hợp bạn không còn có thể truy cập ứng dụng xác thực của bạn.",
    "Generate New Backup Codes": "Tạo New Backup Codes",
    "Each code can only be used once!": "Mỗi mã chỉ có thể được sử dụng một lần!",
    "Used": "Đã sử dụng",
    "Not Used": "Không được sử dụng",
    "I have stored these codes in a safe place": "Tôi đã được lưu trữ các mã ở nơi an toàn",
    "Enable Two Factor Authentication": "Enable Two Factor Authentication",
    "Step 1: Configure your 2FA app": "Bước 1: Cấu hình ứng dụng 2FA của bạn",
    "Most applications will let you set up by scanning the QR code from within the app. If you prefer, you may type the key below the QR code in manually.": "Hầu hết các ứng dụng sẽ cho phép bạn thiết lập bằng cách quét mã QR từ bên trong ứng dụng. Nếu bạn thích, bạn có thể gõ phím bên dưới mã QR trong tay.",
    "Step 2: Enter a 2FA code": "Bước 2: Nhập mã 2FA",
    "Generate a code from your 2FA app and enter it below:": "Tạo mã từ ứng dụng 2FA của bạn và điền dưới đây:",
    "Disable Two Factor Authentication": "Vô hiệu hoá Two Factor Authentication",
    "Authorization Code": "Mã ủy quyền",
    "Remove Two Factor Authentication": "Di chuyển Two Factor Authentication",
    "New Password Confirmation": "Xác nhận mật khẩu mới",
    "If you change your e-mail you will be logged out until you confirm your new e-mail address.": "Nếu bạn thay đổi e-mail của bạn, bạn sẽ được đăng nhập cho đến khi bạn xác nhận địa chỉ e-mail mới của bạn.",
    "Update": "cập nhật",
    "Two Factor Authentication is Enabled": "Two Factor Authentication đã được kích hoạt",
    "View\/Regenerate Recovery Codes": "Xem\/Regenerate Phục hồi Codes",
    "Two Factor Authentication is Disabled": "Two Factor Authentication là Disabled",
    "Avatar": "hình đại diện",
    "Social Provider": "Nhà cung cấp xã hội",
    "Timezone": "Múi giờ",
    "N\/A": "N \/ A",
    "Account Created": "Tài khoản đã được tạo",
    "Last Updated": "Cập nhật mới nhất",
    "A fresh verification link has been sent to your email address.": "Một liên kết xác minh mới đã được gửi đến địa chỉ email của bạn.",
    "Thank you for verifying your e-mail address.": "Cám ơn đã xác nhận địa chỉ email của bạn.",
    "The Application is currently in read only mode. All requests other than GET are disabled.": "Các ứng dụng hiện đang ở chế độ chỉ đọc. Tất cả các yêu cầu khác hơn GET bị vô hiệu hóa.",
    "You are currently logged in as :name.": "Bạn đang đăng nhập như :name.",
    "Return to your account": "Quay trở lại vào tài khoản của bạn",
    "Role Management": "quản lý vai trò",
    "Create Role": "Create Role",
    "There are no permissions to choose from.": "Không có quyền để lựa chọn.",
    "Administrator": "Người quản lý",
    "User": "Người dùng",
    "Update Role": "cập nhật Role",
    "Cancel": "Hủy bỏ",
    "General Permissions": "Quyền chung",
    "Permission Categories": "Danh mục quyền",
    "There are no additional permissions to choose from for this type.": "Không có thêm quyền lựa chọn cho loại hình này.",
    "All Permissions": "Tất cả Quyền",
    "No Permissions": "Không có quyền",
    "There are no roles to choose from for this type.": "Hiện tại không có vai trò để lựa chọn cho loại hình này.",
    "User Management": "Quản lý người dùng",
    "Create User": "Tạo người dùng",
    "Active": "tích cực",
    "Inactive": "Không hoạt động",
    "Deactivated Users": "người dùng vô hiệu hóa",
    "Deleted Users": "người dùng đã xóa",
    "Restore": "khôi phục",
    "Permanently Delete": "vĩnh viễn Xóa",
    "Reactivate": "Kích hoạt",
    "More": "Hơn",
    "Change Password": "Đổi mật khẩu",
    "Clear Session": "Xóa phiên",
    "Deactivate": "Tắt",
    "Yes": "Đúng",
    "No": "Không",
    "Update User": "Cập nhật tài khoản",
    "E-mail Verified": "Email đã kích hoạt",
    "Send Confirmation E-mail": "Gửi nhận E-mail",
    "Change Password for :name": "Thay đổi mật khẩu cho :name",
    "View User": "Xem tài khoản",
    "Back": "Trở lại",
    "Status": "Trạng thái",
    "Last Login At": "Đăng nhập cuối vào",
    "Last Known IP Address": "Địa chỉ IP cuối",
    "Provider": "Các nhà cung cấp",
    "Provider ID": "ID nhà cung cấp",
    "Account Deleted": "Tài khoản đã bị xóa",
    "Copyright": "Bản quyền",
    "All Rights Reserved": "Đã đăng ký Bản quyền",
    "Powered by": "Phát triển bởi",
    "System": "Hệ thống",
    "Access": "Truy cập",
    "Welcome :Name": "Chào mừng bạn :name",
    "Welcome to the Dashboard": "Chào mừng bạn đến Bảng điều khiển",
    "Delete": "Xóa bỏ",
    "Close": "Đóng",
    "Edit": "Sửa",
    "View": "Lượt xem",
    "You can not set a password that you have previously used within the last 3 times.": "Bạn không thể đặt một mật khẩu mà trước đây bạn đã sử dụng trong vòng 3 lần trước.",
    "These credentials do not match our records.": "Những thông tin không phù hợp với hồ sơ của chúng tôi.",
    "Editing :role": "Sửa :role",
    "Home": "Trang chủ"
}
