<?php

return [
    /*
    |--------------------------------------------------------------------------
    | HTTP Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used in the views/errors files.
    |
    */

    '404' => [
        'title' => 'صفحه یافت نشد',
        'description' => 'با عرض پوزش، صفحه‌ای که سعی در مشاهده آن دارید؛ وجود ندارد.',
    ],

    '503' => [
        'title' => 'الآن برمی‌گردم.',
        'description' => 'الآن برمی‌گردم.',
    ],
];
