<?php

return [

    /*
    |--------------------------------------------------------------------------
    | HTTP Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used in the views/errors files.
    |
    */

    '404' => [
        'title'       => 'ไม่พบหน้า',
        'description' => 'ขออภัย ไม่พบหน้าทึ่คุณต้องการ',
    ],

    '503' => [
        'title'       => 'เราจะกลับมาในไม่ช้า',
        'description' => 'เราจะกลับมาในไม่ช้า',
    ],
];
