<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Мовні ресурси для нагадування пароля
    |--------------------------------------------------------------------------
    |
    | Наступні тексти будуть повернуті брокером паролів при помилкових
    | введенях під час редагування паролів користувачем. Наприклад,
    | за недійсного коду зміни пароля або неправильному новому паролі.
    |
    */

    'reset' => 'Ваш пароль змінено!',
    'sent' => 'Ми надіслали на Вашу електронну адресу посилання для зміни пароля!',
    'throttled' => 'Please wait before retrying.',
    'token' => 'Помилковий код для зміни пароля.',
    'user' => 'Користувача з такою електронною адресою не знайдено.',
];
