<?php

return [
    /*
    |--------------------------------------------------------------------------
    | HTTP Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used in the views/errors files.
    |
    */

    '404' => [
        'title' => 'העמוד לא נמצא',
        'description' => 'סליחה, אבל העמוד שאתם מנסים לראות לא קיים',
    ],

    '503' => [
        'title' => 'מיד נשוב.',
        'description' => 'מיד נשוב.',
    ],
];
