<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Языковые ресурсы системы записи истории
    |--------------------------------------------------------------------------
    |
    | Следующие языковые ресурсы используются в названиях
    | системы ведения записи истории приложения.
    | Вы можете свободно изменять эти языковые ресурсы в соответствии
    | с требованиями вашего приложения.
    |
    */

    'backend'   => [
        'none'              => 'Нет записей истории.',
        'none_for_entity'   => 'Нет записей истории для :entity.',
        'none_for_type'     => 'Нет записей истории для этого типа.',
        'recent_history'    => 'Последняя запись истории',
        'roles'             => [
            'created'   => 'создал роль',
            'deleted'   => 'удалил роль',
            'updated'   => 'обновил роль',
        ],
        'users'             => [
            'changed_password'      => 'изменил пароль пользователя',
            'confirmed' => 'confirmed user',
            'created'               => 'создал учётную запись',
            'deactivated'           => 'заблокировал учётную запись',
            'deleted'               => 'удалил учётную запись',
            'deleted_social'      => 'deleted social account',
            'permanently_deleted'   => 'удалил навсегда учётную запись',
            'reactivated'           => 'разблокировал учётную запись',
            'restored'              => 'восстановил учётную запись',
            'updated'               => 'обновил учётную запись',
            'unconfirmed' => 'un-confirmed user',
        ],
    ],
];
