<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Языковые ресурсы HTTP
    |--------------------------------------------------------------------------
    |
    | Следующие языковые ресурсы используются для вывода
    | сообщений во вьюверах страниц ошибок.
    | Вы можете свободно изменять эти языковые ресурсы в соответствии
    | с требованиями вашего приложения.
    |
    */

    '404'   => [
        'description'   => 'Извините, но страница, которую вы пытаетесь просмотреть, не существует.',
        'title'         => 'Страница не найдена',
    ],
    '503'   => [
        'description'   => 'Назад',
        'title'         => 'Назад',
    ],
];
