<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Языковые ресурсы названий менюшек
    |--------------------------------------------------------------------------
    |
    | Следующие языковые ресурсы используются в названиях
    | менюшек всего вашего приложения.
    | Вы можете свободно изменять эти языковые ресурсы в соответствии
    | с требованиями вашего приложения.
    |
    */

    'backend'           => [
        'access'        => [
            'roles' => [
                'all'           => 'Все роли',
                'create'        => 'Создать роль',
                'edit'          => 'Редактировать роль',
                'main'          => 'Роли',
                'management'    => 'Управление доступом',
            ],
            'title' => 'Управление',
            'users' => [
                'all'               => 'Все пользователи',
                'change-password'   => 'Изменить пароль',
                'create'            => 'Создать пользователя',
                'deactivated'       => 'Заблокированные пользователи',
                'deleted'           => 'Удаленные пользователи',
                'edit'              => 'Редактирование учётной записи',
                'main'              => 'Пользователи',
                'view'              => 'Просмотр учётной записи',
            ],
        ],
        'log-viewer'    => [
            'dashboard' => 'Обзор',
            'logs'      => 'Все записи',
            'main'      => 'Журнал ошибок',
        ],
        'sidebar'       => [
            'dashboard' => 'Системная панель',
            'general'   => 'Общие',
            'system'    => 'Система',
        ],
    ],
    'language-picker'   => [
        'langs'     => [
            'ar'    => 'Арабский (Arabic)',
            'zh'    => '(Chinese Simplified)',
            'zh-TW' => '(Chinese Traditional)',
            'da'    => 'Датский (Danish)',
            'de'    => 'Немецкий (German)',
            'el'    => 'Греческий (Greek)',
            'en'    => 'Английский (English)',
            'es'    => 'Испанский (Spanish)',
            'fr'    => 'Французский (French)',
            'id'    => 'Индонезийский (Indonesian)',
            'it'    => 'Итальянский (Italian)',
            'ja'    => '(Japanese)',
            'nl'    => 'Голландский (Dutch)',
            'pt_BR' => 'Бразильский Португальский (Brazilian Portuguese)',
            'ru'    => 'Русский (Russian)',
            'sv'    => 'Шведский (Swedish)',
            'th'    => 'Тайский (Thai)',
            'tr'    => '(Turkish)',
        ],
        'language'  => 'Язык',
    ],
];
