<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Мовні ресурси HTTP
    |--------------------------------------------------------------------------
    |
    | Наступні мовні ресурси використовуються для виводу
    | повідомлень у в'юверах сторінок помилок.
    | Ви можете вільно змінювати ці мовні ресурси відповідно до вимог
    | вашої програми.
    |
    */

    '404' => [
        'description' => 'Вибачте, але сторінки, яку ви намагаєтеся переглянути, не існує.',
        'title' => 'Сторінку не знайдено',
    ],
    '503' => [
        'description' => 'Назад',
        'title' => 'Назад',
    ],
];
